[
{
    "abstract_en": null, 
    "abstract_pt": "O tráfego ilegal de madeiras é um problema no Brasil, percebido com mais frequência nas alfândegas da Amazônia. O objetivo desse trabalho é o desenvolvimento de um método para classificação de imagens de madeira. As imagens, usadas nessa pesquisa, foram fornecidas pela Embrapa e pelo VRI (UFPR). Para o classificador criado, cada imagem é representada pelo histograma resultante da aplicação do operador LBP (Local Binary Patterns). A classificação desenvolvida tem como base o aprendizado baseado em instâncias, utilizando o algoritmo K-NN (K-Nearest Neighbor). O aumento na quantidade de amostras, disponíveis para um mesmo teste, foi suficiente para tornar mais evidentes as diferenças de performance entre as diversos cenários elaborados. Foram consideradas duas abordagens de Cross-Validation: O K-Fold Cross-Validation e o Leave-One-Out Cross-Validation. Quase sempre, quando o Leave-One-Out Cross-Validation foi adotado, os resultados apresentam uma acurácia melhor em relação à outra abordagem. Neste trabalho, também foram realizados alguns testes para mensurar a tolerância alusiva a ruído, e, ficou constatado que o ruído pode influenciar os resultados da classificação. Parece possível afirmar que a normalização influenciou os resultados obtidos pelo classificador, entretanto, dentre as variáveis consideradas, essa foi a menos influente. Foi possível perceber que a métrica adotada, para mensurar distâncias, influencia duas coisas importantes: o índice de acertos e a velocidade de resposta (processamento computacional exigido). O Kullback Leibler Divergence foi a métrica que apresentou melhores resultados. O classificador, construído neste trabalho, se mostrou igualmente eficiente para bases com imagens homogênias (com mesma dimensão e formato) e heterogênias;", 
    "area": "SISTEMAS DE INFORMAÇÃO", 
    "autor": "ALEX PAULO ALVES DE OLIVEIRA", 
    "data": "12/03/2013", 
    "evaluators": [
        {
            "category": "Docente", 
            "name": "CARLOS ALEXANDRE BARROS DE MELLO"
        }
    ], 
    "idiom": "PORTUGUES", 
    "ies": "UNIVERSIDADE FEDERAL DE PERNAMBUCO", 
    "keywords_en": null, 
    "keywords_pt": [
        "Aprendizado de Máquina", 
        " Aprendizado baseado em instância", 
        " Classificação", 
        " Imagem", 
        " Madeira"
    ], 
    "library": "Biblioteca Central da UFPE", 
    "page_count": "143", 
    "program": "CIÊNCIAS DA COMPUTAÇÃO (25001019062P6)", 
    "researchLine": "COMPUTAÇÃO INTELIGENTE", 
    "researchProjet": null, 
    "sameArea": "Não", 
    "sensei": "GEORGE DARMITON DA CUNHA CAVALCANTI", 
    "sponsors": [], 
    "title": "Um método para classificação de imagens de madeira usando Local Binary Patterns", 
    "tpExpc": "Ensino e Pesquisa", 
    "tpVes": "Instituição de Ensino e Pesquisa", 
    "tpVinc": "Servidor Público", 
    "type_": "DISSERTAÇÃO", 
    "volume": "02"
},
{
    "abstract_en": null, 
    "abstract_pt": "A pesquisa apresenta um método para priorização de projetos de desenvolvimento de software. Através do estudo realizado com 13 projetos desenvolvidos no NTI/UFPE e juntamente com a pesquisa bibliográfica citada no trabalho, definimos uma lista de critérios que deveriam ser considerados na priorização e seleção do desenvolvimento de novos projetos. Para avaliar a proposta, utilizamos os projetos desenvolvidos no NTI nos últimos dois anos, os quais nos fez concluir que esta ferramenta seria útil para o órgão identificar quais os projetos que trariam mais benefícios para a organização e quais deveriam ter prioridade no desenvolvimento, minimizando os riscos de fracassos nos projetos. Ao final, propomos um processo de desenvolvimento de software fazendo uso do método de priorização definido.", 
    "area": "SISTEMAS DE INFORMAÇÃO", 
    "autor": "AURENEIA BARBOSA DE SANTANA DINIZ FERRAZ", 
    "data": "10/12/2013", 
    "evaluators": [
        {
            "category": "Participante Externo", 
            "name": "MARIA DA CONCEICAO MORAES BATISTA"
        }, 
        {
            "category": "Docente", 
            "name": "HERMANO PERRELLI DE MOURA"
        }
    ], 
    "idiom": "PORTUGUES", 
    "ies": "UNIVERSIDADE FEDERAL DE PERNAMBUCO", 
    "keywords_en": null, 
    "keywords_pt": [
        "Melhoria de Processos", 
        " Metodologias Ágeis", 
        " Priorização de projetos", 
        " Gerenciamento de Portfólio", 
        " Processo de Desenvolvimento de Software"
    ], 
    "library": "Biblioteca Central da UFPE", 
    "page_count": "112", 
    "program": "CIÊNCIAS DA COMPUTAÇÃO (25001019062P6)", 
    "researchLine": "ENGENHARIA DE SOFTWARE", 
    "researchProjet": null, 
    "sameArea": "Sim", 
    "sensei": "VINICIUS CARDOSO GARCIA", 
    "sponsors": [], 
    "title": "Definição de um método que estabelece critérios para priorização de novos projetos e aplicação em um processo de desenvolvimento de software", 
    "tpExpc": "Outros", 
    "tpVes": "Instituição de Ensino e Pesquisa", 
    "tpVinc": "Servidor Público", 
    "type_": "DISSERTAÇÃO", 
    "volume": "02"
},
{
    "abstract_en": null, 
    "abstract_pt": "O Mapeador de Teses e Dissertações da UFPE (MTD-UFPE) é um sistema que objetiva a recuperação de informações na Biblioteca Digital de Teses e Dissertações da UFPE e que consiste de uma interface de navegação e pesquisa utilizando mapa de documentos. Um mapa de documentos é construído com o uso de mapas auto-organizáveis (SOM). SOM é um tipo de rede neural que usa a técnica de aprendizado competitivo e têm grande potencial no agrupamento de documentos de textos similares. No sistema MTD-UFPE, o treinamento do mapa de documentos era realizado externamente, precisando-se passar os arquivos que representam os vetores documentos para treinamento através do MATLAB, tornando-se uma atividade custosa. Assim, este trabalho tem o objetivo de incorporar ao sistema MTD-UFPE um processo automático de treinamento do mapa de documentos e também implementar um método de marcação no mapa que identifique as regiões que contém os documentos resultantes das pesquisas. Visando esta automação no processo de treinamento integrou-se ao MTD-UFPE a ferramenta de código livre, Java SomToolbox, desenvolvida pelo Instituto de Tecnologia de Software e Sistemas Interativos da Universidade de Vienna e que permite o treinamento de mapas auto-organizáveis. Foi possível obter mapas com os documentos de treinamento agrupados de acordo com a semelhança contextual e constatou-se que a ferramenta apresenta vários recursos visuais para análise dos agrupamentos. A funcionalidade de marcação das regiões no mapa que englobam os documentos das pesquisas trouxe como benefício a agilidade na navegação no sentido de localizar facilmente os documentos desejados e os correlacionados.", 
    "area": "SISTEMAS DE INFORMAÇÃO", 
    "autor": "UBIRACY DOS SANTOS REGO JUNIOR", 
    "data": "28/11/2013", 
    "evaluators": [
        {
            "category": "Docente", 
            "name": "CLEBER ZANCHETTIN"
        }, 
        {
            "category": "Participante Externo", 
            "name": "RENATO FERNANDES CORREA"
        }, 
        {
            "category": "Docente", 
            "name": "RICARDO BASTOS CAVALCANTE PRUDENCIO"
        }
    ], 
    "idiom": "PORTUGUES", 
    "ies": "UNIVERSIDADE FEDERAL DE PERNAMBUCO", 
    "keywords_en": null, 
    "keywords_pt": [
        "mapas auto-organizáveis (SOM)", 
        " agrupamento de documentos textuais", 
        " recuperação de informação", 
        " biblioteca digital de teses e dissertações", 
        " UFPE"
    ], 
    "library": "Biblioteca Central da UFPE", 
    "page_count": "87", 
    "program": "CIÊNCIAS DA COMPUTAÇÃO (25001019062P6)", 
    "researchLine": "COMPUTAÇÃO INTELIGENTE", 
    "researchProjet": null, 
    "sameArea": "Não", 
    "sensei": "TERESA BERNARDA LUDERMIR", 
    "sponsors": [], 
    "title": "Aperfeiçoamento do Mapeador de Teses e Dissertações da UFPE", 
    "tpExpc": "Outros", 
    "tpVes": "Instituição de Ensino e Pesquisa", 
    "tpVinc": "Servidor Público", 
    "type_": "DISSERTAÇÃO", 
    "volume": "02"
},
{
    "abstract_en": null, 
    "abstract_pt": "O aumento na complexidade do ambiente de negócios e o acirramento da competição implicam a necessidade de informações para tomada de decisão em um espaço de tempo cada vez menor. Por outro lado, sistemas de informação mais abrangentes e complexos geram cada vez mais dados, tornando inviável a atividade de auditoria não assistida por métodos computacionais. As técnicas de inteligência artificial, particularmente aprendizagem de máquina, estão entre as mais apropriadas para lidar com esse tipo de problema. Dentre as técnicas de aprendizagem de máquina, as redes neurais artificiais vêm desempenhando um papel comprovadamente eficaz como ferramenta de apoio a atividade de auditoria. Diante desse cenário e alinhado ao estado da arte no uso da tecnologia da informação na atividade de auditoria, essa dissertação propõe a construção de um framework para detecção de anomalias em bases de dados baseado na rede neural artificial Mapas auto-organizáveis - Self-Organizing Maps (SOM). Utilizando as propriedades de mapeamento da Rede SOM, o framework consiste em: (i) demonstrar que dados visualmente distantes da área de influência da rede SOM são anomalias, e (ii) estabelecer um critério, baseado em intervalo de confiança, para classificação dos dados como possíveis anomalias independentemente da região do mapa SOM em que se encontrem. Ademais, este trabalho realiza a análise de trajetória SOM na função de classificador dos dados como possível anomalia, a fim de comparar o limiar fixo baseado na vizinhança do neurônio com o limiar baseado em intervalo de confiança. O framework proposto foi aplicado em uma base de dados real de folha de pagamento. Os resultados apresentados na dissertação mostraram que o framework conseguiu obter bons resultados neste problema.", 
    "area": "SISTEMAS DE INFORMAÇÃO", 
    "autor": "ANDERSON DE SOUZA ANDRADE", 
    "data": "12/04/2013", 
    "evaluators": [
        {
            "category": "Docente", 
            "name": "FRANCISCO DE ASSIS TENORIO DE CARVALHO"
        }, 
        {
            "category": "Participante Externo", 
            "name": "RENATO FERNANDES CORREA"
        }
    ], 
    "idiom": "PORTUGUES", 
    "ies": "UNIVERSIDADE FEDERAL DE PERNAMBUCO", 
    "keywords_en": null, 
    "keywords_pt": [
        "Mapas auto-organizáveis", 
        " SOM", 
        " Aprendizagem de Máquina", 
        " Descoberta de Conhecimento em Bases de Dados", 
        " KDD", 
        " Mineração de Dados", 
        " DM", 
        " Análise de Trajetória SOM"
    ], 
    "library": "Biblioteca Central da UFPE", 
    "page_count": "87", 
    "program": "CIÊNCIAS DA COMPUTAÇÃO (25001019062P6)", 
    "researchLine": "COMPUTAÇÃO INTELIGENTE", 
    "researchProjet": null, 
    "sameArea": "Não", 
    "sensei": "ADRIANO LORENA INACIO DE OLIVEIRA", 
    "sponsors": [], 
    "title": "Framework para detecção de anomalias em bases de folha de pagamento baseado em mapas auto-organizáveis", 
    "tpExpc": "-", 
    "tpVes": "-", 
    "tpVinc": "-", 
    "type_": "DISSERTAÇÃO", 
    "volume": "02"
},
{
    "abstract_en": null, 
    "abstract_pt": "Este trabalho tem como objetivo a análise da prática docente de planejamento de aula com abordagem de uma educação mista, blended learning, em professores do ensino superior, mediado por uma rede social educacional – REDU – visando elicitar requisitos funcionais e apresentar protótipos de telas, que visem melhorar essa interação do docente com a plataforma. O método em uso remete ao de múltiplos estudos de caso dividio em três fases principais de: 1 - definir e desenhar, 2 - preparar coletar e analisar e 3 - analisar e concluir. Uma amostragem proposital foi escolhida com professores de diferentes cursos, formação acadêmica e tempo de magistério. Os resultados apresentados trouxeram a realidade da sensação do docente em utilizar a abordagem da educação mista, a partir do uso da rede social educacional, de tal forma que o professor opte por novas possibilidades de interação com seus alunos, atuando mais como mediador de processos de aprendizagem colaborativa, do que somente como transmissor de teorias. Isto posto, melhorias foram propostas à plataforma através de requisitos funcionais, assim como novos modelos de telas a serem implementadas à rede, que trarão benefícios reais a um modelo de educação centrado numa aprendizagem compartilhada a partir de um planejamento docente voltado a esta nova realidade de estudo.", 
    "area": "SISTEMAS DE INFORMAÇÃO", 
    "autor": "THIAGO BESSA PONTES", 
    "data": "08/11/2013", 
    "evaluators": [
        {
            "category": "Participante Externo", 
            "name": "ROBERTA VARGINHA RAMOS CAIADO"
        }, 
        {
            "category": "Docente", 
            "name": "FERNANDO DA FONSECA DE SOUZA"
        }
    ], 
    "idiom": "PORTUGUES", 
    "ies": "UNIVERSIDADE FEDERAL DE PERNAMBUCO", 
    "keywords_en": null, 
    "keywords_pt": [
        "prática docente; aprendizagem colaborativa; rede social educacional"
    ], 
    "library": "Biblioteca Central da UFPE", 
    "page_count": "111", 
    "program": "CIÊNCIAS DA COMPUTAÇÃO (25001019062P6)", 
    "researchLine": "COMPUTAÇÃO INTELIGENTE", 
    "researchProjet": null, 
    "sameArea": "Sim", 
    "sensei": "ALEX SANDRO GOMES", 
    "sponsors": [], 
    "title": "O planejamento de aula no ensino superior na modalidade blended learning. Requisitos para rede social educativa", 
    "tpExpc": "Ensino e Pesquisa", 
    "tpVes": "Instituição de Ensino e Pesquisa", 
    "tpVinc": "CLT", 
    "type_": "DISSERTAÇÃO", 
    "volume": "02"
},
{
    "abstract_en": null, 
    "abstract_pt": "O controle e manutenção do acesso granular aos dados, ou seja, no nível de linha e coluna, sobretudo em organizações que dispõem de diversos sistemas de banco de dados distintos, é um problema em aberto, em que há poucos estudos de como resolver o problema a partir de um método ou solução única para o controle, de forma corporativa, da segurança no acesso aos dados das diversas bases disponíveis. As soluções presentes atualmente no mercado estão disponíveis apenas para sistemas de gerenciamento de banco de dados (SGBD) cujo licenciamento muitas vezes impede a utilização deste recurso. Além disso, tais soluções são proprietárias e só funcionam em um único SGBD. Muitas aplicações utilizam o conceito de visões (views) para prover o controle de acesso granular. No entanto, apesar de flexível, não é uma solução prática porque as lógicas das visões podem se tornar bastante complexas para garantir o controle de acesso, dificultando o gerenciamento e manutenção das mesmas. Além disso, é uma solução com baixa escalabilidade quando existe um número grande de usuários e perfis de acesso. Desta forma, grande parte das aplicações implementa o controle de acesso dentro do código da aplicação. Isso proporciona uma séria de desvantagens e de falhas de segurança associadas. Este trabalho traz uma proposta de metodologia para controle de acesso granular em sistemas de banco de dados relacionais open source. Esta solução combina sistemas de banco de dados relacionais open source com a intervenção dos comandos SQL através do driver de acesso ao banco de dados. O driver customizado lê e aplica políticas de segurança previamente armazenadas em um banco de dados embarcado, alterando o comando SQL e, consequentemente, o resultado apresentado ao usuário final. Um protótipo foi desenvolvido como prova de conceito e os experimentos foram baseados no SGBD MySQL usando o driver JDBC. Para tanto, este trabalho aborda os principais conceitos de segurança da informação, segurança de banco de dados, modelos de autorização e os principais mecanismos de controle de acesso utilizados em sistemas de banco de dados relacionais como o DAC, MAC e RBAC. Além disso, foram abordados o conceito de controle de acesso granular aos dados bem como os principais mecanismos utilizados no mercado. Após isto, são analisados alguns estudos que apresentam alternativas para o problema do controle de acesso granular aos dados. Por fim, são apresentadas as conclusões e sugestões de trabalhos futuros dentro da área de estudo.", 
    "area": "SISTEMAS DE INFORMAÇÃO", 
    "autor": "MAURICIO GUEDES MARQUES", 
    "data": "18/03/2013", 
    "evaluators": [
        {
            "category": "Participante Externo", 
            "name": "CARLOS EDUARDO SANTOS PIRES"
        }, 
        {
            "category": "Participante Externo", 
            "name": "ANA CAROLINA BRANDAO SALGADO"
        }
    ], 
    "idiom": "PORTUGUES", 
    "ies": "UNIVERSIDADE FEDERAL DE PERNAMBUCO", 
    "keywords_en": null, 
    "keywords_pt": [
        "Banco de dados", 
        " Segurança de dados", 
        " Políticas de Segurança", 
        " Controle de Acesso"
    ], 
    "library": "Biblioteca Central da UFPE", 
    "page_count": "136", 
    "program": "CIÊNCIAS DA COMPUTAÇÃO (25001019062P6)", 
    "researchLine": "BANCO DE DADOS", 
    "researchProjet": null, 
    "sameArea": "Sim", 
    "sensei": "FERNANDO DA FONSECA DE SOUZA", 
    "sponsors": [], 
    "title": "Uma metodologia para controle de acesso granular em sistemas de banco de dados relacionais open source", 
    "tpExpc": "Outros", 
    "tpVes": "Empresa Privada", 
    "tpVinc": "CLT", 
    "type_": "DISSERTAÇÃO", 
    "volume": "02"
},
{
    "abstract_en": null, 
    "abstract_pt": "A presença de textos manuscritos e impressos em um mesmo documento representa um grande desafio para os atuais mecanismos de Reconhecimento Ótico de Caracteres. Uma vez que essas classes de texto possuem suas próprias rotinas de reconhecimento, o uso de técnicas que permitam diferenciação entre elas tornou-se algo indispensável cujo bom funcionamento depende da escolha de características que melhor representem os elementos de texto sobre os quais os classificadores devem atuar. Considerando que na literatura existe uma grande variedade de características utilizadas para este fim, este trabalho objetiva o desenvolvimento de um método que permita, através de um processo de otimização com Algoritmos Genéticos e a partir de um conjunto inicial de 52 características, a seleção de subconjuntos de melhores características que, além de menores que o conjunto original, possibilitem melhoria dos resultados de classificação. Os experimentos foram realizados com classificadores kNN e Redes Neurais MLP a partir de imagens de palavras segmentadas. O método proposto foi avaliado fazendo uso de uma base de dados pública para textos manuscritos e outra criada especificamente para este trabalho para textos impressos. Os resultados dos experimentos mostram que os objetivos propostos foram alcançados e que obtivemos um menor Erro Médio de Classificação com Redes Neurais MLP em contraponto a uma melhor performance obtida com o kNN. A influência dos diferentes tipos de fontes e estilos utilizados nos textos impressos também foi analisada e mostrou que as fontes que imitam textos manuscritos como a \"Lucida Handwriting\" apresentam maiores ocorrências de erros de classificação. Da mesma forma, a maioria dos erros foi percebida nos textos impressos com estilo itálico.", 
    "area": "SISTEMAS DE INFORMAÇÃO", 
    "autor": "GLEYDSON VILANOVA VIANA COELHO", 
    "data": "26/03/2013", 
    "evaluators": [
        {
            "category": "Participante Externo", 
            "name": "TSANG ING REN"
        }, 
        {
            "category": "Participante Externo", 
            "name": "WELLINGTON PINHEIRO DOS SANTOS"
        }
    ], 
    "idiom": "PORTUGUES", 
    "ies": "UNIVERSIDADE FEDERAL DE PERNAMBUCO", 
    "keywords_en": null, 
    "keywords_pt": [
        "Diferenciação entre Manuscritos e Impressos", 
        " Otimização", 
        " Redução de Dimensionalidade", 
        " Seleção de Características", 
        " Algoritmos Genéticos", 
        " kNN", 
        " Redes Neurais"
    ], 
    "library": "Biblioteca Central da UFPE", 
    "page_count": "113", 
    "program": "CIÊNCIAS DA COMPUTAÇÃO (25001019062P6)", 
    "researchLine": "COMPUTAÇÃO INTELIGENTE", 
    "researchProjet": null, 
    "sameArea": "Sim", 
    "sensei": "GEORGE DARMITON DA CUNHA CAVALCANTI", 
    "sponsors": [], 
    "title": "Seleção de Características usando Algoritmos Genéticos para Classificação de Imagens de Textos em Manuscritos e Impressos", 
    "tpExpc": "Outros", 
    "tpVes": "Instituição de Ensino e Pesquisa", 
    "tpVinc": "CLT", 
    "type_": "DISSERTAÇÃO", 
    "volume": "02"
},
{
    "abstract_en": null, 
    "abstract_pt": "Pesquisas realizadas no mundo inteiro indicam que o uso de tecnologias sociais como blogs, microblogs, chats, compartilhamento de vídeos e redes sociais tem aumentado consideravelmente nas organizações. A troca de experiência entre os usuários, a gestão de conhecimento, a manutenção da memória organizacional, o estabelecimento de conexões para a promoção de parcerias e colaboração são os principais benefícios da utilização destes sistemas. Os fornecedores de sistemas de gestão empresarial como os ERPs (Enterprise Resource Planning Systems), que antes tinham o foco na automatização dos processos operacionais, agora precisam evoluir seus produtos com da inclusão de funcionalidades sociais e de comunicação. Esta pesquisa tem como principal objetivo investigar como funcionalidades de comunicação podem ser inseridas nos ERPs para que estes evoluam para um perfil mais social. Para entender melhor estes desafios, foi realizada uma análise de competidores que identifica como os principais fornecedores de ERPs estão trabalhando em relação a inclusão de funcionalidades sociais em seus sistemas. Foi visto que todos optaram por criar suas próprias redes sociais corporativas, independentes, mas integradas aos sistemas de gestão. Também foram aplicados questionários para clientes e colaboradores de uma empresa fornecedora de ERPs, para avaliação dos benefícios da inclusão de funcionalidades sociais no sistema por ela desenvolvido e identificação de funcionalidades sociais mais relevantes. O aprendizado obtido durante o estudo nos fez vislumbrar que a melhor forma de utilizar funcionalidades sociais no ERP seria para dar suporte ao uso do mesmo. Os usuários gostariam de através das funcionalidades sociais sanar dúvidas, esclarecer procedimentos e receber orientações de forma ágil. Assim, concluiu-se que um bom caminho para a evolução do ERP seria a criação de uma Ajuda Social, complementando os formatos de ajuda tradicionais com a construção colaborativa de conhecimento. A partir desta avaliação, foram especificados e avaliados requisitos funcionais e protótipos que serviram de proposta de evolução do sistema. Esta pesquisa apresenta contribuições teóricas e práticas para área de desenvolvimento de ERPs. Do ponto de vista teórico, os trabalhos acadêmicos sobre ERPs têm tratado freqüentemente das falhas durante as implantações dos sistemas nas organizações. Esta pesquisa visa contribuir com uma proposta de evolução dos mesmos. Em relação à contribuição prática, os resultados apresentados na dissertação podem ser diretamente aplicados em projetos de desenvolvimento de ERPs com funcionalidades sociais.", 
    "area": "SISTEMAS DE INFORMAÇÃO", 
    "autor": "BRUNO PIMENTEL DE SANTANA", 
    "data": "05/04/2013", 
    "evaluators": [
        {
            "category": "Docente", 
            "name": "PATRICIA CABRAL DE AZEVEDO RESTELLI TEDESCO"
        }
    ], 
    "idiom": "PORTUGUES", 
    "ies": "UNIVERSIDADE FEDERAL DE PERNAMBUCO", 
    "keywords_en": null, 
    "keywords_pt": [
        "ERP", 
        " Redes Sociais", 
        " Sistemas de Gestão Empresarial", 
        " Comunicação"
    ], 
    "library": "Biblioteca Central da UFPE", 
    "page_count": "122", 
    "program": "CIÊNCIAS DA COMPUTAÇÃO (25001019062P6)", 
    "researchLine": "GESTÃO EM TECNOLOGIA DA INFORMAÇÃO", 
    "researchProjet": null, 
    "sameArea": "Sim", 
    "sensei": "CARINA FROTA ALVES", 
    "sponsors": [], 
    "title": "Inserindo funcionalidades de redes sociais em sistemas de gestão empresarial", 
    "tpExpc": "Empresas", 
    "tpVes": "Empresa Privada", 
    "tpVinc": "CLT", 
    "type_": "DISSERTAÇÃO", 
    "volume": "02"
},
{
    "abstract_en": null, 
    "abstract_pt": "A maioria dos estudos sobre fatores críticos de sucesso aponta que projetos de software falham por não entregar valor aos interessados. Uma das áreas de pesquisa da Engenharia de Software é a Engenharia de Software Baseada em Valor \u0096 VBSE, a qual busca incorporar atividades de criação de valor nos processos de desenvolvimento de software. Segundo ela, o sucesso de um software vai mais além do que uma simples adequação a modelos técnicos. Excelência técnica é altamente desejável, mas insuficiente. Nos últimos anos, a utilização de métodos ágeis tem crescido de forma acentuada, sendo que, segundo pesquisas recentes, Scrum é o método ágil mais utilizado. Estes métodos têm como um de seus princípios a entrega de valor ao cliente. Desta forma, este trabalho analisou a aderência do Scrum à VBSE. A análise foi realizada tendo como base os princípios e valores definidos no manifesto ágil e os elementos-chave que formam a base da VBSE. O resultado da análise mostrou que o Scrum já é aderente a alguns desses elementos-chave. Entretanto, outros elementos-chave da VBSE não são abordados. Para preencher essas lacunas, foi proposta uma extensão que consiste na criação de novos artefatos e no acréscimo de atividades ao processo do Scrum. Tal extensão visa contribuir para que os softwares entregues criem valor para os interessados, sem descaracterizar a agilidade do Scrum. Como método de avaliação, foi aplicado um questionário a profissionais com experiência em Scrum a fim de verificar o grau de concordância em relação à extensão proposta. O resultado da avaliação mostrou que maioria dos respondentes concorda com a extensão e considera que a criação de valor para os interessados deve ser o objetivo principal de um projeto de software.", 
    "area": "SISTEMAS DE INFORMAÇÃO", 
    "autor": "JOSE WALLACE RIBEIRO DE MACEDO JUNIOR", 
    "data": "18/04/2013", 
    "evaluators": [
        {
            "category": "Docente", 
            "name": "ALEXANDRE MARCOS LINS DE VASCONCELOS"
        }, 
        {
            "category": "Participante Externo", 
            "name": "JOSE GILSON DE ALMEIDA TEIXEIRA FILHO"
        }
    ], 
    "idiom": "PORTUGUES", 
    "ies": "UNIVERSIDADE FEDERAL DE PERNAMBUCO", 
    "keywords_en": null, 
    "keywords_pt": [
        "Engenharia de Software Baseada em Valor - VBSE", 
        " Criação de Valor", 
        " Gerenciamento Ágil de Projetos", 
        " Scrum."
    ], 
    "library": "Biblioteca Central da UFPE", 
    "page_count": "103", 
    "program": "CIÊNCIAS DA COMPUTAÇÃO (25001019062P6)", 
    "researchLine": "ENGENHARIA DE SOFTWARE", 
    "researchProjet": null, 
    "sameArea": "Sim", 
    "sensei": "HERMANO PERRELLI DE MOURA", 
    "sponsors": [], 
    "title": "Uma extensão do Scrum com foco na criação de valor", 
    "tpExpc": "Outros", 
    "tpVes": "Empresa Pública ou Estatal", 
    "tpVinc": "Servidor Público", 
    "type_": "DISSERTAÇÃO", 
    "volume": "02"
},
{
    "abstract_en": null, 
    "abstract_pt": "Atualmente, cada vez mais existem SGBDs que disponibilizam tipos de dados com características geométricas e temporais, para indicar a localização de um dado objeto móvel no espaço e no tempo, ou demarcar topologicamente uma dada região. Isso se deve ao aumento do uso de tecnologias de localização geográfica, tal como o Sistema de Posicionamento Global (GPS). Cada vez mais cresce o uso de GPS por aplicações de domínios distintos. No entanto, os dados coletados por dispositivos de localização acoplados a objetos móveis que se deslocam ao longo do espaço e do tempo, não apresentam informações semânticas, dificultando a análise e compreensão destes dados. Por isso, nós identifcamos a falta de SGBDs capazes de representar e manipular trajetórias semânticas. Existem vários trabalhos na literatura voltados para modelagem de trajetórias semânticas e para análise de trajetórias brutas extraídas de GPS para extração de conhecimento. Uma vez geradas e modeladas, as trajetórias semânticas precisam ser armazenadas em um SGBD. Por isso, este trabalho tem como objetivo estender o SGBD PostgreSQL/Postgis com novos tipos de dados para representação de trajetória semântica. Para facilitar a utilização desses novos tipos de dados, é também proposta uma API denominada de DBST (Database of Semantic Trajectories). A validação destes novos tipos de dados e da API DBST foi feita pela geração de bases de dados de trajetórias semânticas para dois domínios de aplicação distintos e com base em dados reais de trajetórias de objetos móveis.", 
    "area": "SISTEMAS DE INFORMAÇÃO", 
    "autor": "RODRIGO DA ROCHA BORGES DE SANTANA", 
    "data": "19/04/2013", 
    "evaluators": [
        {
            "category": "Docente", 
            "name": "FERNANDO DA FONSECA DE SOUZA"
        }, 
        {
            "category": "Participante Externo", 
            "name": "MARIZETE SILVA SANTOS"
        }
    ], 
    "idiom": "PORTUGUES", 
    "ies": "UNIVERSIDADE FEDERAL DE PERNAMBUCO", 
    "keywords_en": null, 
    "keywords_pt": [
        "Trajetória bruta", 
        " trajetória semântica", 
        " dados espaço-temporais", 
        " objetos móveis", 
        " API."
    ], 
    "library": "Biblioteca Central da UFPE", 
    "page_count": "113", 
    "program": "CIÊNCIAS DA COMPUTAÇÃO (25001019062P6)", 
    "researchLine": "BANCO DE DADOS", 
    "researchProjet": null, 
    "sameArea": "Sim", 
    "sensei": "VALERIA CESARIO TIMES", 
    "sponsors": [], 
    "title": "DBST: Uma API para Criação de Trajetórias Semânticas no SGBD", 
    "tpExpc": "Outros", 
    "tpVes": "Instituição de Ensino e Pesquisa", 
    "tpVinc": "CLT", 
    "type_": "DISSERTAÇÃO", 
    "volume": "02"
},
{
    "abstract_en": null, 
    "abstract_pt": "Os textos semi-estruturados possuem alguma modelagem, mas podem apresentar características de campos ausentes, ou ordem de campos trocada, ausência de delimitadores entre campos ou ainda palavras abreviadas e frases que não são formadas de acordo com a linguagem natural, como exemplo o diário da justiça eletrônico. A abordagem que utilizamos para realizar trabalho foi a extração de informação automática de características dos diários da justiça eletrônico, é através de expressões regulares, onde classificamos cada linha do documento de acordo com a informação a ser extraída. Essa abordagem é presa às regras (expressões regulares) construídas. Então, sua manutenção é complicada porque é preciso construir novas expressões regulares para uma nova estrutura que não esteja prevista. A construção das regras que tenham como objetivo casamento de padrões no diário eletrônico deve possibilitar a interação entre a quantidade de regras existentes e a eficiência das mesmas. Para que tal situação venha favorecer o desenvolvimento conceitual de novas implementações de regras, é necessário o entendimento de como as regras estão divididas em proporção a quantidade de atributos citados no diário eletrônico. Com a efetiva solução do problema de extração das informações, através do sistema de manutenção das regras e após ter sido criado um fluxo, foi possível observar o melhoramento na qualidade das informações extraídas.", 
    "area": "SISTEMAS DE INFORMAÇÃO", 
    "autor": "LAERTE RODRIGUES JUNIOR", 
    "data": "19/04/2013", 
    "evaluators": [
        {
            "category": "Participante Externo", 
            "name": "RENATO FERNANDES CORREA"
        }, 
        {
            "category": "Docente", 
            "name": "PATRICIA CABRAL DE AZEVEDO RESTELLI TEDESCO"
        }
    ], 
    "idiom": "PORTUGUES", 
    "ies": "UNIVERSIDADE FEDERAL DE PERNAMBUCO", 
    "keywords_en": null, 
    "keywords_pt": [
        "Extração de Informação", 
        " Expressão Regulares", 
        " Regras", 
        " Diários da Justiça"
    ], 
    "library": "Biblioteca Central da UFPE", 
    "page_count": "72", 
    "program": "CIÊNCIAS DA COMPUTAÇÃO (25001019062P6)", 
    "researchLine": "COMPUTAÇÃO INTELIGENTE", 
    "researchProjet": null, 
    "sameArea": "Sim", 
    "sensei": "RICARDO BASTOS CAVALCANTE PRUDENCIO", 
    "sponsors": [], 
    "title": "Extração de Informação Semi-estruturada em Diários Eletrônicos da Justiça", 
    "tpExpc": "Empresas", 
    "tpVes": "Empresa Privada", 
    "tpVinc": "CLT", 
    "type_": "DISSERTAÇÃO", 
    "volume": "02"
},
{
    "abstract_en": null, 
    "abstract_pt": "A MultiDimensional eXpression (MDX) é uma linguagem de consulta para processamento analítico de dados ou On-line Analytical Processing (OLAP). Apesar de esta linguagem ser usada pela maioria dos servidores OLAP, esta não é um padrão de direito. Portanto, tem-se pouca (ou nenhuma) garantia de que as funções MDX usadas por um servidor OLAP também possam ser usadas em outros servidores. Neste contexto, de forma a investigar a conformidade à linguagem MDX de um servidor OLAP de código aberto e outro de código fechado, os servidores Mondrian e Analysis Services, por serem bem aceitos tanto pela academia quanto pela indústria, foram respectivamente escolhidos. Para realizar este estudo comparativo, o qual consiste em examinar se existe diferença entre a gramática da linguagem MDX usadas por estes servidores, será utilizada a seguinte estratégia: identificar quais funções são específicas de um servidor, quais funções são comuns aos servidores e, dentre as funções comuns (i.e., com o mesmo nome), se existe diferença de sintaxe entre elas. De forma a executar este estudo, será apresentado o cenário de testes aplicados, bem como a ferramenta TestMDX que foi desenvolvida para automatizar a execução dos testes. Por fim, será apresentada uma análise dos resultados obtidos.", 
    "area": "SISTEMAS DE INFORMAÇÃO", 
    "autor": "ERIVAM ANSELMO DE ALBUQUERQUE", 
    "data": "22/04/2013", 
    "evaluators": [
        {
            "category": "Participante Externo", 
            "name": "BERNADETTE FARIAS LOSCIO"
        }, 
        {
            "category": "Participante Externo", 
            "name": "MARIA DA CONCEICAO MORAES BATISTA"
        }
    ], 
    "idiom": "PORTUGUES", 
    "ies": "UNIVERSIDADE FEDERAL DE PERNAMBUCO", 
    "keywords_en": null, 
    "keywords_pt": [
        "Estudo de Conformidade. Linguagem MDX. OLAP"
    ], 
    "library": "Biblioteca Central da UFPE", 
    "page_count": "107", 
    "program": "CIÊNCIAS DA COMPUTAÇÃO (25001019062P6)", 
    "researchLine": "BANCO DE DADOS", 
    "researchProjet": null, 
    "sameArea": "Sim", 
    "sensei": "ROBSON DO NASCIMENTO FIDALGO", 
    "sponsors": [], 
    "title": "Uma análise da conformidade dos servidores Analysis Services e Mondrian à linguagem MDX", 
    "tpExpc": "Ensino e Pesquisa", 
    "tpVes": "Instituição de Ensino e Pesquisa", 
    "tpVinc": "CLT", 
    "type_": "DISSERTAÇÃO", 
    "volume": "02"
},
{
    "abstract_en": null, 
    "abstract_pt": "Com o aumento da complexidade dos projetos, o cumprimento dos objetivos planejados se torna cada vez mais difícil de ser alcançado. Gerenciar empreendimentos sob a ótica de projetos tornou-se uma solução cada vez mais praticada por organizações, onde a complexidade e a dinamicidade dos fatores que compõem um mercado globalizado não permitem falhas na condução dos investimentos e na manutenção do seu mercado. Em muitas organizações ainda é possível observar a falta de um modelo eficaz de gestão e de um nivelamento no conhecimento efetivo em gestão de projetos, fatores que contribuem para o fracasso de diversas iniciativas. Modelos de maturidade em projeto têm sido estudados e desenvolvidos para apoiar e dirigir as estratégias de gestão de projetos. À medida que cresce a procura pelo gerenciamento de projetos, maior é a necessidade de melhor compreender as competências e habilidades que devem fazer parte do perfil do gerente de projetos. Há uma crescente preocupação com o perfil necessário do gerente do projeto para o melhor desempenho de suas atribuições. Identificar o perfil adequado do gerente de projetos no contexto da organização é fundamental para alcançar os resultados esperados. Neste cenário, o papel do gerente de projetos ganha maior importância, exigindo dos profissionais maior capacitação. Por isso é importante que tenhamos a capacidade de delinear os conhecimentos, habilidades e atitudes necessários à realização desta atividade. Essa Dissertação de Mestrado busca identificar quais competências complementam esse perfil.", 
    "area": "SISTEMAS DE INFORMAÇÃO", 
    "autor": "WASHINGTON DE ALMEIDA FRANCO", 
    "data": "22/04/2013", 
    "evaluators": [
        {
            "category": "Participante Externo", 
            "name": "CRISTINE MARTINS GOMES DE GUSMAO"
        }, 
        {
            "category": "Participante Externo", 
            "name": "JOSE GILSON DE ALMEIDA TEIXEIRA FILHO"
        }, 
        {
            "category": "Docente", 
            "name": "HERMANO PERRELLI DE MOURA"
        }
    ], 
    "idiom": "PORTUGUES", 
    "ies": "UNIVERSIDADE FEDERAL DE PERNAMBUCO", 
    "keywords_en": null, 
    "keywords_pt": [
        "Gerenciamento de Projetos", 
        " Desenvolvimento de Competências do Gerente de Projetos", 
        " Framework PMCD", 
        " PMBOK", 
        " Maturidade Organizacional", 
        " Maturidade em Gerenciamento de Projetos."
    ], 
    "library": "Biblioteca Central da UFPE", 
    "page_count": "47", 
    "program": "CIÊNCIAS DA COMPUTAÇÃO (25001019062P6)", 
    "researchLine": "GESTÃO EM TECNOLOGIA DA INFORMAÇÃO", 
    "researchProjet": null, 
    "sameArea": "Sim", 
    "sensei": "RICARDO MASSA FERREIRA LIMA", 
    "sponsors": [], 
    "title": "Avaliação da Maturidade em Gerenciamento de Projetos: Uma perspectiva do Gerente de Projetos", 
    "tpExpc": "Ensino e Pesquisa", 
    "tpVes": "Instituição de Ensino e Pesquisa", 
    "tpVinc": "CLT", 
    "type_": "DISSERTAÇÃO", 
    "volume": "02"
},
{
    "abstract_en": null, 
    "abstract_pt": "Nos últimos anos, com uma economia mundial globalizada, as empresas têm buscado cada vez mais por novas tecnologias que lhes permitam obter informações integradas de suas diversas áreas, visando o auxilio no processo decisório. Com tal intuito, surgiram os sistemas ERP\u0092s (Enterprise Resource Planning, ou ), cuja a principal característica é integrar as informações de toda companhia, proporcionando uma visão gerencial única de todas as suas áreas. Não indiferente a esse cenário, as empresas sucroalcooleiras tem adquirido e executado projetos de implantação de sistemas ERP\u0092s em suas unidades. Neste contexto, pesquisas veem sendo realizadas sobre o que leva um projeto a ser bem sucedido. Uma das áreas pesquisadas são os fatores críticos para o sucesso de cada projeto, ou seja, o que deve ser mais focado, pois falhas podem trazer consequências para o projeto e em muitos casos culminar em seu insucesso. Identificar os fatores críticos de sucesso pode minimizar os riscos e maximizar a probabilidade de sucesso do projeto. Esse trabalho mapeou os principais fatores críticos para o sucesso de projetos de implantação de ERP de manutenção industrial em usinas do ramo sucroalcooleiro, através de um estudo de caso e uma pesquisa de campo com diversos profissionais e companhias de tal área de negócio, que já passaram ou estão passando por esse tipo de processo no Brasil.", 
    "area": "SISTEMAS DE INFORMAÇÃO", 
    "autor": "ARQUIMEDES SIDNEY LIMA DE MEDEIROS", 
    "data": "22/04/2013", 
    "evaluators": [
        {
            "category": "Participante Externo", 
            "name": "ANDRE LUIS DE MEDEIROS SANTOS"
        }, 
        {
            "category": "Participante Externo", 
            "name": "METHANIAS COLACO RODRIGUES JUNIOR"
        }
    ], 
    "idiom": "PORTUGUES", 
    "ies": "UNIVERSIDADE FEDERAL DE PERNAMBUCO", 
    "keywords_en": null, 
    "keywords_pt": [
        "Usinas Sucroalcooleiras", 
        " Enterprise Resource Planning", 
        " Manutenção Industrial", 
        " Fatores Críticos."
    ], 
    "library": "Biblioteca Central da UFPE", 
    "page_count": "200", 
    "program": "CIÊNCIAS DA COMPUTAÇÃO (25001019062P6)", 
    "researchLine": "ENGENHARIA DE SOFTWARE", 
    "researchProjet": null, 
    "sameArea": "Sim", 
    "sensei": "HERMANO PERRELLI DE MOURA", 
    "sponsors": [], 
    "title": "Fatores Críticos de Sucesso em Projetos de Implantação de ERP de Manutenção Industrial em Usinas Sucroalcooleiras", 
    "tpExpc": "Outros", 
    "tpVes": "Empresa Privada", 
    "tpVinc": "CLT", 
    "type_": "DISSERTAÇÃO", 
    "volume": "02"
},
{
    "abstract_en": null, 
    "abstract_pt": "A busca contínua por ferramentas que propiciem às empresas a obtenção de vantagem competitiva, o controle de suas atividades internas e externas e o gerenciamento do grande volume de informações que permeiam os negócios, fazem com que atualmente quase todas as atividades empresarias sejam controladas por software. De posse de novas tecnologias, muitas empresas buscam soluções corporativas que atendam suas necessidades e optam pela aquisição de pacotes de sistema, o que justifica os investimentos significativos nesse setor. Por sua vez, uma escolha são os sistemas integrados de gestão denominados de Enterprise Resource Planning \u0096 ERP, os quais podem ser definidos como um conjunto integrado de softwares que ajudam no gerenciamento dos negócios da empresa, facilitando a integração das áreas, que mesmo com operações distintas, podem trabalhar em conjunto, gerando maior rapidez e eficiência nos diversos departamentos como finanças, recursos humanos, contabilidade, compra e venda. O presente trabalho visa fazer um estudo dos Fatores Críticos de Sucesso para implantação dos sistemas ERP, por meio de revisão bibliográfica e a observação da ocorrência desses fatores em uma implantação no estudo de caso único de uma organização do setor educacional privado. Para isso, foram realizadas, visita técnica, entrevista e aplicação de um questionário em uma empresa selecionada por ser um caso de sucesso nesse tipo de implantação. Como resultado, foram identificados e compilados os FCS que segundos os autores referenciados nesse estudo, contribuem para o sucesso de uma implantação de sistemas ERP. Através de uma análise qualitativa fica claro a relevância de se identificar os FCS, bem como, a verificação desses fatores para o sucesso da implantação de sistemas ERP em instituições de ensino superior privado.", 
    "area": "SISTEMAS DE INFORMAÇÃO", 
    "autor": "JORGE RANIERE SILVERIO CANDIDO", 
    "data": "30/04/2013", 
    "evaluators": [
        {
            "category": "Participante Externo", 
            "name": "JOSE GILSON DE ALMEIDA TEIXEIRA FILHO"
        }, 
        {
            "category": "Docente", 
            "name": "ROBSON DO NASCIMENTO FIDALGO"
        }
    ], 
    "idiom": "PORTUGUES", 
    "ies": "UNIVERSIDADE FEDERAL DE PERNAMBUCO", 
    "keywords_en": null, 
    "keywords_pt": [
        "Fatores Críticos de Sucesso; Sistemas Integrados de Gestão; Implantação de ERP; ensino superior privado."
    ], 
    "library": "Biblioteca Central da UFPE", 
    "page_count": "131", 
    "program": "CIÊNCIAS DA COMPUTAÇÃO (25001019062P6)", 
    "researchLine": "GESTÃO EM TECNOLOGIA DA INFORMAÇÃO", 
    "researchProjet": null, 
    "sameArea": "Sim", 
    "sensei": "HERMANO PERRELLI DE MOURA", 
    "sponsors": [], 
    "title": "Um Estudo sobre Fatores Críticos de Sucesso na Implantação de Sistemas ERP em Instituições Privadas de Ensino Superior", 
    "tpExpc": "Ensino e Pesquisa", 
    "tpVes": "Instituição de Ensino e Pesquisa", 
    "tpVinc": "CLT", 
    "type_": "DISSERTAÇÃO", 
    "volume": "02"
},
{
    "abstract_en": null, 
    "abstract_pt": "Nos últimos anos temos visto o crescimento exponencial da competitividade entre as empresas dos mais diversos setores. Adventos como a globalização e o surgimento da internet eliminaram as fronteiras do comércio, tornando possível a busca de novos mercados e acirrando ainda mais a competição. Uma das consequências desse mundo globalizado e sem fronteiras é a necessidade cada vez maior das companhias em buscar de estratégias inovadoras, capazes de atender as novas demandas e estarem a frente de seus concorrentes. Muitas vezes, seja por necessidade ou por desconhecimento acerca do assunto, muitas empresas tratam a inovação como sendo algo puramente tecnológico e não colocam o tema em pauta de forma correta, considerando a inovação como parte efetiva da estratégia da companhia. Por outro lado, há também organizações que tratam do tema inovação, divulgam a sua importância internamente, executam iniciativas, mas não possuem uma gestão efetiva da inovação e dos processos envolvidos, não havendo uma continuidade das ações e os resultados obtidos são pontuais ou pouco relevantes. O desconhecimento acerca dos conceitos de inovação, seus processos, mecanismos, modelos de gestão e a ausência do simples \u0093saber por onde começar\u0094, limitam ou impedem das organizações praticarem a inovação. O objetivo principal desse trabalho é tentar facilitar esse entendimento, apresentar os principais conceitos de gestão de inovação, analisa-los e demonstrar qual o caminho inicial seguido em uma instituição de ensino superior privada. A analise desse estudo de caso poderá servir de base para futuros estudos ou adoção em outras empresas do mesmo segmento na região.", 
    "area": "SISTEMAS DE INFORMAÇÃO", 
    "autor": "FABIO BATISTA SANTOS", 
    "data": "30/04/2013", 
    "evaluators": [
        {
            "category": "Participante Externo", 
            "name": "DECIO FONSECA"
        }, 
        {
            "category": "Participante Externo", 
            "name": "CRISTIANO COELHO DE ARAUJO"
        }
    ], 
    "idiom": "PORTUGUES", 
    "ies": "UNIVERSIDADE FEDERAL DE PERNAMBUCO", 
    "keywords_en": null, 
    "keywords_pt": [
        "Inovação. Gerenciamento. Gerenciamento da Inovação. Modelos de inovação."
    ], 
    "library": "Biblioteca Central da UFPE", 
    "page_count": "106", 
    "program": "CIÊNCIAS DA COMPUTAÇÃO (25001019062P6)", 
    "researchLine": "GESTÃO EM TECNOLOGIA DA INFORMAÇÃO", 
    "researchProjet": null, 
    "sameArea": "Sim", 
    "sensei": "HERMANO PERRELLI DE MOURA", 
    "sponsors": [], 
    "title": "Gestão da Inovação: Um estudo de caso em instituição de ensino superior privada", 
    "tpExpc": "Empresas", 
    "tpVes": "Empresa Privada", 
    "tpVinc": "CLT", 
    "type_": "DISSERTAÇÃO", 
    "volume": "02"
},
{
    "abstract_en": null, 
    "abstract_pt": "Este trabalho tem como objetivo analisar o ensino de Programação Orientada a Objeto (POO) mediado por plataforma social educacional para propor melhorias dos estilos de interação de colaboração e percepção visando aprimorar a experiência dos usuários nessas atividades. Como método corresponde às etapas de progresso que consistem na fase exploratória, a delimitação do estudo, a preparação das atividades, a análise sistemática e a elaboração do relatório. Para amostragem proposital será alunos da disciplina de Programação Orientada a Objeto do curso presencial de Licenciatura em Computação. Os resultados do estudo mostram que a combinação da ferramenta colaborativa para o ensino de programação orientada a objeto é apresentado como uma nova metodologia de ensino para que o professor reflita sua prática de ensino, passando de transmissor do conteúdo para mediador do processo de obtenção do conhecimento. Estes resultados permitiram propor novos requisitos funcionais que venham a melhorar a Rede Social Educacional \u0096 REDU, que favoreça uma educação mais colaborativa por meio da mediação dos docentes e alunos na execução de suas atividades de ensino.", 
    "area": "SISTEMAS DE INFORMAÇÃO", 
    "autor": "ELIAS VIDAL BEZERRA JUNIOR", 
    "data": "14/06/2013", 
    "evaluators": [
        {
            "category": "Participante Externo", 
            "name": "MARCIO LOPES CORNELIO"
        }, 
        {
            "category": "Participante Externo", 
            "name": "AYLA DEBORA DANTAS DE SOUZA REBOUCAS"
        }
    ], 
    "idiom": "PORTUGUES", 
    "ies": "UNIVERSIDADE FEDERAL DE PERNAMBUCO", 
    "keywords_en": null, 
    "keywords_pt": [
        "programação orientada a objeto; aprendizagem colaborativa; rede social educacional"
    ], 
    "library": "Biblioteca Central da UFPE", 
    "page_count": "141", 
    "program": "CIÊNCIAS DA COMPUTAÇÃO (25001019062P6)", 
    "researchLine": "COMPUTAÇÃO INTELIGENTE", 
    "researchProjet": null, 
    "sameArea": "Sim", 
    "sensei": "ALEX SANDRO GOMES", 
    "sponsors": [], 
    "title": "Análise da prática docente no processo de ensino de programação orientada a objeto mediado por meio de rede social educativa", 
    "tpExpc": "Ensino e Pesquisa", 
    "tpVes": "Instituição de Ensino e Pesquisa", 
    "tpVinc": "Servidor Público", 
    "type_": "DISSERTAÇÃO", 
    "volume": "02"
},
{
    "abstract_en": null, 
    "abstract_pt": "A ausência de um bom gerenciamento nos negócios é um dos principais motivos para o seu fracasso. A implantação de alguma forma de business intelligence (BI) para tomada de decisão, através de seus métodos ou ferramentas, viabiliza melhorias significativas no gerenciamento das empresas. Um bom exemplo para gerenciar em uma empresa, seja ela do ramo de serviços ou varejo, é o controle de notas fiscais que entram e saem do estabelecimento. Com o controle dessas notas, o administrador ou gerente do estabelecimento possui muita informação, da qual pode tomar inúmeras decisões, mas que dependerão de sua análise final, pois para cada resultado obtido através de um BI, o cenário pode ser diferente para cada empresa. Logo, a proposta deste trabalho é apresentar um sistema que irá fazer análise das notas fiscais eletrônicas (NFe), cujo uso é obrigatórios para muitos contribuintes e em pouco tempo será obrigatório de maneira geral. Neste sistema será armazenado o documento no formato XML e, através dele, carregado o BI para uma análise mais detalhada das informações. Com os resultados obtidos, ficou evidenciado que o sistema atende aos requisitos levantados, de maneira a facilitar as atividades dos contribuintes para melhor gerenciar o seu negócio do ponto de vista fiscal.", 
    "area": "SISTEMAS DE INFORMAÇÃO", 
    "autor": "BRUNO LEONARDO FREIRE FREITAS ANDRADE", 
    "data": "21/06/2013", 
    "evaluators": [
        {
            "category": "Docente", 
            "name": "ROBSON DO NASCIMENTO FIDALGO"
        }, 
        {
            "category": "Participante Externo", 
            "name": "METHANIAS COLACO RODRIGUES JUNIOR"
        }
    ], 
    "idiom": "PORTUGUES", 
    "ies": "UNIVERSIDADE FEDERAL DE PERNAMBUCO", 
    "keywords_en": null, 
    "keywords_pt": [
        "Gerenciamento do Negócio", 
        " Controle", 
        " Nota Fiscal Eletrônica", 
        " Informação", 
        " Análise", 
        " Tomada de decisão."
    ], 
    "library": "Biblioteca Central da UFPE", 
    "page_count": "133", 
    "program": "CIÊNCIAS DA COMPUTAÇÃO (25001019062P6)", 
    "researchLine": "BANCO DE DADOS", 
    "researchProjet": null, 
    "sameArea": "Sim", 
    "sensei": "FERNANDO DA FONSECA DE SOUZA", 
    "sponsors": [], 
    "title": "Gerenciamento e Auditoria Fiscal Eletrônica através do uso de documentos XML como objetos para tomada de decisão com Business Intelligence", 
    "tpExpc": "Empresas", 
    "tpVes": "Empresa Privada", 
    "tpVinc": "CLT", 
    "type_": "DISSERTAÇÃO", 
    "volume": "02"
},
{
    "abstract_en": null, 
    "abstract_pt": "Esta pesquisa tem como objetivo oferecer uma análise sobre o impacto da Lei de Informática no relacionamento de cooperação em projetos de Pesquisa, Desenvolvimento e Inovação (P,D&I) entre os agentes da Hélice Tríplice, representados pelo Governo, Indústria e Institutos de Ciência e Tecnologia (ICT), privados e públicos, sendo os públicos representados pelos Institutos de Ensino Superior (IES). A motivação para realização desta pesquisa foi influenciada por constatações do relatório da Unicamp, encomendado pelo Ministério de Ciência, Tecnologia e Inovação (MCTI), no período de 1998 a 2008, que indicou que ICTs públicos receberam 1/20 do valor total disponível de investimento de Lei de Informática e 30% das empresas beneficiárias consideram muito pouco relevantes a parceria com os ICTs, tanto públicos como privados. Esta dissertação realizou uma pesquisa empírica com agentes da Hélice Tríplice envolvidos em projetos de cooperação através na Lei de Informática. Dessa forma, para realizar a coleta de dados foram aplicados os métodos de questionário e entrevista semiestruturada. O questionário foi aplicado a 28 representantes de empresas beneficiárias da Lei de Informática, visando entender a qualidade do relacionamento com os ICT´s públicos e privados durante os processos de pré-venda e execução de projetos de Lei de Informática. As entrevistas semiestruturadas foram aplicadas a quatro representantes de ICTs públicos e privados, quatro representantes empresas beneficiárias e três do governo, que possuem cargos no MCTI. Este estudo empírico forneceu informações que podem apoiar ICT´s e empresas novatas que desejam se habilitar junto ao MCTI, onde as contribuições mais relevantes sobre o impacto da Lei de Informática à luz da Hélice Tríplice apontadas foram: 1) Conhecer o nível de qualidade percebido pelas empresas na relação com os ICT´s no tocante aos processos de pré-venda e execução dos projetos de Lei de Informática; 2) Elucidar quais os principais benefícios da Lei de Informática; 3) Elencar quais as principais dificuldades relacionadas com a Lei de Informática; 4) Coletar sugestões para que a Lei de Informática se torne mais eficiente; 5) Entender as diferenças de relacionamentos com ICTs públicos e privados; 6) Visualizar as barreiras na cooperação com ICTs públicos; e 7) Demonstrar os facilitadores na cooperação com ICTs públicos. Por fim, o estudo forneceu uma avaliação crítica do governo brasileiro sobre os resultados mais relevantes, confirmando a estratégia de implementar uma política de avanço e refinamento da Lei de Informática no Brasil na oportunidade de uma renovação em 2019.", 
    "area": "SISTEMAS DE INFORMAÇÃO", 
    "autor": "SARAH REGINA FERREIRA MESEL", 
    "data": "10/10/2013", 
    "evaluators": [
        {
            "category": "Participante Externo", 
            "name": "ANDRE LUIS DE MEDEIROS SANTOS"
        }
    ], 
    "idiom": "PORTUGUES", 
    "ies": "UNIVERSIDADE FEDERAL DE PERNAMBUCO", 
    "keywords_en": null, 
    "keywords_pt": [
        "Lei de Informática", 
        " Cooperação", 
        " Hélice Tríplice", 
        " Pesquisa", 
        " Desenvolvimento e Inovação (P", 
        "D&I)."
    ], 
    "library": "Biblioteca Central da UFPE", 
    "page_count": "117", 
    "program": "CIÊNCIAS DA COMPUTAÇÃO (25001019062P6)", 
    "researchLine": "ENGENHARIA DE SOFTWARE", 
    "researchProjet": null, 
    "sameArea": "Sim", 
    "sensei": "CARINA FROTA ALVES", 
    "sponsors": [], 
    "title": "Um Estudo Empírico sobre a Relação dos Agentes da Hélice Tríplice no Contexto da Lei de Informática", 
    "tpExpc": "Outros", 
    "tpVes": "Instituição de Ensino e Pesquisa", 
    "tpVinc": "CLT", 
    "type_": "DISSERTAÇÃO", 
    "volume": "02"
},
{
    "abstract_en": null, 
    "abstract_pt": "Hoje no início do século XXI somos protagonistas e testemunha das transformações na educação, num momento em que a tecnologia estimula modificações no processo educacional através do ensino à distância alcançando todas as classes sócias em todo território nacional, onde nesta fase de transição as instituições educacionais necessitam absorver as novas tecnologias conjuntamente a criação de processos de gestão, em busca de uma educação qualidade para todos. Este trabalho analisou e evidenciou especificamente entraves e dificuldades em cursos de Educação à distância no tocante ao sistema de avaliação e o seu material didático. Nesse sentido, foram identificados riscos e deficiências no processo de gestão das avaliações decorrente do excesso de procedimentos manuais realizados pelos usuários, falta de comunicação interrompendo o fluxo do processo ou acarretando problemas na importação das questões para o ambiente virtual de aprendizagem ou mesmo na aplicação das avaliações. Com o objetivo de auxiliar os docentes e os gestores que atuam nos cursos de educação à distância, foi desenvolvida neste trabalho, uma metodologia de gestão para o processo das avaliações dos cursos oferecidos na modalidade à distância, que conta com uma ferramenta que proporcione não somente uma maior normatização das atividades de todos os profissionais envolvidos, mas também uma melhor produtividade e melhoria na qualidade da produção do material das avaliações. Esta metodologia nos levou ao desenvolvimento de uma ferramenta baseada no Microsoft Word, na qual foi possível agregar as suas facilidades, grande utilização e o conhecimento prévio por parte da maioria dos profissionais da educação a distância, num processo GED compartilhado uma proporcionou uma padronização do layout das atividades. Num estudo de caso realizado na Universidade de Pernambuco nos cursos de educação a distância onde foram utilizadas 150 atividades, totalizando 1300 itens, onde os procedimentos de padronização, conversão e importação das atividades agora automatizadas tiveram um desempenho superior em 80% quando comparados aos mesmos processos realizados de forma manual e uma diminuição 75% dos erros de transcrição das importações medidos pelos profissionais envolvidos nesta tarefa, detectado também pela comparação do procedimento manual versus procedimento automatizado, possibilitando esta ferramenta o acompanhamento do processo de gestão das atividades, documentação e recuperação de informações.", 
    "area": "SISTEMAS DE INFORMAÇÃO", 
    "autor": "JOSE ALEXANDRO VIANA FONSECA", 
    "data": "11/10/2013", 
    "evaluators": [
        {
            "category": "Participante Externo", 
            "name": "EDUARDO ARAUJO OLIVEIRA"
        }, 
        {
            "category": "Docente", 
            "name": "FERNANDO DA FONSECA DE SOUZA"
        }
    ], 
    "idiom": "PORTUGUES", 
    "ies": "UNIVERSIDADE FEDERAL DE PERNAMBUCO", 
    "keywords_en": null, 
    "keywords_pt": [
        "Educação a Distância", 
        " Ambientes Virtuais", 
        " Apoio à Prática Docente", 
        " Gestão de Conteúdo", 
        " Avaliação na EaD."
    ], 
    "library": "Biblioteca Central da UFPE", 
    "page_count": "89", 
    "program": "CIÊNCIAS DA COMPUTAÇÃO (25001019062P6)", 
    "researchLine": "COMPUTAÇÃO INTELIGENTE", 
    "researchProjet": null, 
    "sameArea": "Sim", 
    "sensei": "PATRICIA CABRAL DE AZEVEDO RESTELLI TEDESCO", 
    "sponsors": [], 
    "title": "Gestão das avaliações presenciais na EAD: A visão sistêmica do processo baseado no gerenciamento eletrônico de documentos", 
    "tpExpc": "Outros", 
    "tpVes": "Instituição de Ensino e Pesquisa", 
    "tpVinc": "Servidor Público", 
    "type_": "DISSERTAÇÃO", 
    "volume": "02"
},
{
    "abstract_en": null, 
    "abstract_pt": "Contexto: Em 2012, um experimento na Universidade de Queensland analisou modelos de processos elaborados por analistas sem experiência, utilizando lápis, papel e pouco ou nenhum conhecimento sobre notações ou métodos de modelagem. Foram analisados os estilos de representação escolhidos, a expressividade dos modelos, a relação entre estilo e expressividade e o desempenho dos indivíduos após capacitá-los em uma notação para modelagem de processos (BPMN). Os resultados obtidos, analisados quantitativamente, motiva- ram o interesse em replicar o experimento. Objetivo: Replicar o experimento australiano para comparar os resultados obtidos mediante outro método de análise. Para enriquecer a pesquisa, foram executadas três replicações, em grupos com perfis acadêmicos e profissionais diferentes. Resultados: Os resultados, semelhantes à pesquisa original, mostraram a predominância de um estilo de representação, o fluxograma. Ao comparar as notas atribuídas aos modelos com notação livre e BPMN, foi detectada uma correlação positiva \u0096 um possível relacionamento \u0096 entre elas. A habilidade artística confirmou-se indiferente nas escolhas tomadas. Estendendo a pesquisa original, foi identificado o principal motivo da preferência pelo fluxograma, que é a sua simplicidade. Também foi identificada uma discreta, porém consistente, superioridade dos modelos gerados por grupos formados por acadêmicos em comparação ao formado por profissionais com prática na execução de processo, entre outras inferências. Conclusões: Modelos desenhados em notação livre podem descrever processos tão bem quanto diagramas usando os elementos básicos de BPMN, desde que o analista adote critérios de clareza como o detalhamento das atividades e seu sequenciamento, destacando as tomadas de decisão e os indivíduos envolvidos.", 
    "area": "SISTEMAS DE INFORMAÇÃO", 
    "autor": "CLAYTON JOSE ARAUJO DE AGUIAR", 
    "data": "18/11/2013", 
    "evaluators": [
        {
            "category": "Participante Externo", 
            "name": "DENIS SILVA DA SILVEIRA"
        }, 
        {
            "category": "Participante Externo", 
            "name": "CARLA TACIANA LIMA LOURENCO SILVA SCHUENEMANN"
        }
    ], 
    "idiom": "PORTUGUES", 
    "ies": "UNIVERSIDADE FEDERAL DE PERNAMBUCO", 
    "keywords_en": null, 
    "keywords_pt": [
        "replicação", 
        " experimento", 
        " modelagem BPMN"
    ], 
    "library": "Biblioteca Central da UFPE", 
    "page_count": "108", 
    "program": "CIÊNCIAS DA COMPUTAÇÃO (25001019062P6)", 
    "researchLine": "ENGENHARIA DE SOFTWARE", 
    "researchProjet": null, 
    "sameArea": "Sim", 
    "sensei": "CARINA FROTA ALVES", 
    "sponsors": [], 
    "title": "Como analistas sem experiência modelam processos de negócio: replicação externa de um estudo empírico", 
    "tpExpc": "Outros", 
    "tpVes": "Empresa Pública ou Estatal", 
    "tpVinc": "Servidor Público", 
    "type_": "DISSERTAÇÃO", 
    "volume": "02"
},
{
    "abstract_en": null, 
    "abstract_pt": "Com o advento do uso de serviços hospedados em cenários de computação em nuvem, presencia-se a necessidade de entidades públicas utilizarem seus benefícios. Neste âmbito, empresas governamentais ainda possuem receio em hospedarem seus dados em ambiente de computação em nuvem, o que por sua vez, faz com que muitas dessas entidades utilizem um modelo de oferta de serviços tradicionais não otimizados no contexto de recursos computacionais. Devido a isso, a computação em nuvem privada surge como ambiente alternativo para hospedagem de serviços dentro da própria infraestrutura da empresa pública, suprimindo as preocupações de conformidades à segurança da informação e adequação do modelo de oferta de serviços. Com o objetivo de discutir e ampliar a literatura acerca do assunto, são apresentados passos a serem utilizados para implantação de um cenário em computação em nuvem privada, como solução destes problemas em uma empresa pública de processamento de dados. Como contribuição prática, o estudo apresenta uma solução escalável com baixo investimento, uma vez que todo o cenário proposto é utilizado em ferramental de software livre, permitindo impactos positivos e valor agregado no modelo de oferta de serviços do provedor para os clientes. Palavras-chave : Computação em nuvem, processamento de dados, software livre", 
    "area": "SISTEMAS DE INFORMAÇÃO", 
    "autor": "JOSE LUTIANO COSTA DA SILVA", 
    "data": "19/11/2013", 
    "evaluators": [
        {
            "category": "Docente", 
            "name": "NELSON SOUTO ROSA"
        }, 
        {
            "category": "Participante Externo", 
            "name": "RODRIGO ELIA ASSAD"
        }
    ], 
    "idiom": "PORTUGUES", 
    "ies": "UNIVERSIDADE FEDERAL DE PERNAMBUCO", 
    "keywords_en": null, 
    "keywords_pt": [
        "Computação em nuvem", 
        " processamento de dados", 
        " software livre"
    ], 
    "library": "Biblioteca Central da UFPE", 
    "page_count": "95", 
    "program": "CIÊNCIAS DA COMPUTAÇÃO (25001019062P6)", 
    "researchLine": "ENGENHARIA DE SOFTWARE", 
    "researchProjet": null, 
    "sameArea": "Sim", 
    "sensei": "VINICIUS CARDOSO GARCIA", 
    "sponsors": [], 
    "title": "A Adoção de Computação em Nuvem Privada em uma Empresa de Processamento de Dados Estadual: Os Impactos de Implantação em seu Ambiente Corporativo", 
    "tpExpc": "Ensino e Pesquisa", 
    "tpVes": "Instituição de Ensino e Pesquisa", 
    "tpVinc": "Servidor Público", 
    "type_": "DISSERTAÇÃO", 
    "volume": "02"
},
{
    "abstract_en": null, 
    "abstract_pt": "Esta pesquisa tem como objetivo principal investigar quais são os Fatores Críticos de Sucesso (FCS) em Iniciativas de Gestão de Processos de Negócio (Business Process Management \u0096 BPM) e quais são as recomendações para o gerenciamento dos mesmos. A identificação dos FCS em iniciativas de BPM é um tema bastante relevante tendo em vista o alto custo de tais projetos, a cobrança por transparência e efetividade dos resultados pelos patrocinadores, e o impacto que possuem na cultura organizacional. A falta de gerenciamento de tais aspectos pode influenciar o alto índice de falhas em projetos BPM. Diante desta motivação, para investigar esse campo de pesquisa foi executado um Mapeamento Sistemático (MS) da literatura, que identificou 31 estudos, dos quais 15 foram considerados relevantes. O MS revelou 19 fatores críticos e também identificou recomendações para o gerenciamento deles. São exemplos de fatores críticos: medição de desempenho, pessoas, empowerment e uso de sistemas de melhoria contínua. Através da análise dos resultados, é possível ter uma visão de quais fatores merecem atenção durante a implantação de iniciativas de BPM, além identificar possíveis estratégias para gerenciá-los. O número reduzido de estudos evidencia o tratamento ainda incipiente do assunto pela literatura de BPM, o que serve de estímulo à realização de trabalhos futuros abordando este tema, de forma empírica e teórica.", 
    "area": "SISTEMAS DE INFORMAÇÃO", 
    "autor": "EMMANUEL FARIAS DA SILVA FILHO", 
    "data": "21/11/2013", 
    "evaluators": [
        {
            "category": "Participante Externo", 
            "name": "DECIO FONSECA"
        }, 
        {
            "category": "Participante Externo", 
            "name": "SIMONE CRISTIANE DOS SANTOS LIMA"
        }
    ], 
    "idiom": "PORTUGUES", 
    "ies": "UNIVERSIDADE FEDERAL DE PERNAMBUCO", 
    "keywords_en": null, 
    "keywords_pt": [
        "Gestão de Processos de Negócio", 
        " Fatores Críticos de Sucesso", 
        " Gerenciamento"
    ], 
    "library": "Biblioteca Central da UFPE", 
    "page_count": "105", 
    "program": "CIÊNCIAS DA COMPUTAÇÃO (25001019062P6)", 
    "researchLine": "ENGENHARIA DE SOFTWARE", 
    "researchProjet": null, 
    "sameArea": "Sim", 
    "sensei": "CARINA FROTA ALVES", 
    "sponsors": [], 
    "title": "Fatores Críticos de Sucesso em Iniciativas de BPM: Um Mapeamento Sistemático da Literatura", 
    "tpExpc": "Empresas", 
    "tpVes": "Empresa Privada", 
    "tpVinc": "CLT", 
    "type_": "DISSERTAÇÃO", 
    "volume": "02"
},
{
    "abstract_en": null, 
    "abstract_pt": "A demanda por profissionais cada vez mais qualificados implica no aumento da oferta de cursos dos mais variados. A Educação a Distância (EAD) desempenha papel importante nessa seara, na medida em que permite que um aluno adquira conhecimento sem estar presente fisicamente na sala de aula. Além disso, alguns cursos necessitam da utilização de um laboratório para que o aluno aplique os conhecimentos teóricos aprendidos em sala de aula. Por outro lado, os ambientes virtuais de aprendizagem tradicionais não possuem artefatos que permitam que o aluno se sinta motivado para a construção daquele conhecimento. Nesse contexto, este trabalho apresenta um processo para criação de um ambiente imersivo, com aplicação na construção de um laboratório virtual utilizando o Second Life. Ainda, foi desenvolvido um experimento que constou de uma atividade dentro do ambiente construído. Os resultados mostraram indícios de que o laboratório imersivo \u0096 construído a partir do processo elaborado \u0096 contribuiu para o aumento da motivação do aluno, dadas as características de interação, múltiplas perspectivas, fidelidade e relevância da lição no ambiente real.", 
    "area": "SISTEMAS DE INFORMAÇÃO", 
    "autor": "FABIO MARIZ MAIA PESSOA", 
    "data": "22/11/2013", 
    "evaluators": [
        {
            "category": "Docente", 
            "name": "FERNANDO DA FONSECA DE SOUZA"
        }, 
        {
            "category": "Participante Externo", 
            "name": "EDUARDO ARAUJO OLIVEIRA"
        }
    ], 
    "idiom": "PORTUGUES", 
    "ies": "UNIVERSIDADE FEDERAL DE PERNAMBUCO", 
    "keywords_en": null, 
    "keywords_pt": [
        "Aprendizagem Imersiva", 
        " Mundo Virtual", 
        " Second Life", 
        " Motivação."
    ], 
    "library": "Biblioteca Central da UFPE", 
    "page_count": "79", 
    "program": "CIÊNCIAS DA COMPUTAÇÃO (25001019062P6)", 
    "researchLine": "COMPUTAÇÃO INTELIGENTE", 
    "researchProjet": null, 
    "sameArea": "Sim", 
    "sensei": "PATRICIA CABRAL DE AZEVEDO RESTELLI TEDESCO", 
    "sponsors": [], 
    "title": "Aprendizagem Imersiva em Mundos Virtuais", 
    "tpExpc": "Empresas", 
    "tpVes": "Empresa Privada", 
    "tpVinc": "CLT", 
    "type_": "DISSERTAÇÃO", 
    "volume": "02"
},
{
    "abstract_en": null, 
    "abstract_pt": "Redes sociais podem ser definidas como um conjunto de dois elementos: atores ou nós (pessoas, instituições ou grupos) e suas conexões (interações ou laços sociais). Apesar de seu estudo remontar dos anos 50, com foco na sociologia e antropologia, apenas a partir da segunda metade do século começaram os estudos com foco entre as interações das partes, culminando nos anos 90, onde a matemática e a ciência da computação contribuíram com a análise de redes sociais (ARS) com o auxílio de programas de computador, atingindo desta forma valor multidisciplinar. Emergiram-se daí, interesses no estudo das redes sociais devido ao aumento da vida urbana e pelas comunicações mediadas por computador, onde a informação tornou-se base para a análise de fluxo das interações entre as pessoas, grupos humanos e organizações. No cotidiano, as redes podem ser direcionadas tão somente pelas conexões humanas, como também na tomada de decisões estratégicas, aquisição de conhecimento, e seus efeitos nas relações entre indivíduos e organizações. Recentemente, o desenvolvimento das tecnologias da informação e comunicação tem concentrado esforços e interesses na utilização de redes sociais para internet (RSI) em diversos setores da sociedade: comércio, indústria, economia, artes, cultura e educação. Contudo, emerge uma discussão especifica sobre as redes sociais voltadas para negócios por ser uma ferramenta que impulsiona e fortalece o desenvolvimento das relações entre mercado e empreendedores. Novos negócios são criados como resultado das motivações dos empreendedores quando obtiveram recursos e descobriram novas oportunidades, todavia, as redes sociais tem importante papel não apenas na fundação de um negócio, elas também atingem no contínuo desenvolvimento da manutenção deste, formando através de contatos formais ou informais as vantagens competitivas que definirão seu capital social. No Brasil, as micro e pequenas empresas utilizam-se destas ferramentas, não apenas para se comunicar com seu cliente, como também diferencial competitivo ao oferecer produtos e serviços ao seu público alvo e se obter de informações exclusivas. Entretanto, apesar da disseminação do uso das redes, elas ainda não oferecem todas as condições e recursos necessários na capacitação do empreendedor e fortalecimento do seu negócio. Esta pesquisa tem como objetivos analisar as redes sociais empresariais e criar um modelo de rede social voltado para o empreendedor de micro e pequenas empresas no Brasil. Foi realizado um estudo descritivo de dez redes sociais de negócios existentes no mercado nacional e internacional através de um questionário estruturado em tópicos que abordam desde a natureza das conexões entre os usuários, passando pelo seu modelo de rentabilidade até a análise de experiência de uso da rede online. Da mesma forma, os tópicos abordados neste questionário foram organizados de maneira pragmática, tendo como objetivos verificar se a aplicação analisada realmente estava alinhada às características próprias de uma rede social, além de certificar a existência de características relacionadas ao empreendedor, suas necessidades, natureza das conexões e recursos utilizados para a formação de um negócio. Tendo em vista a escassez na literatura de metodologias classificatórias de redes sociais online, o questionário teve papel fundamental no levantamento dos requisitos e na construção do modelo de rede social proposto. A maioria das redes sociais analisadas provê ao usuário recursos necessários ao desenvolvimento do negócio, contudo outros requisitos essenciais para a manutenção da rede do empreendedor, tais como conexões de confiança, informações exclusivas, experiência de uso do sistema não foram percebidos em 90% da amostra. Percebeu-se ainda há inexistência de modelos de redes sociais no Brasil que abranjam de forma plena a rede do empreendedor de micro e pequenas empresas, contudo esforços têm sido feitos no sentido de preencher esta lacuna no mercado nacional através de iniciativas do governo federal, e parcerias público-privadas como Portal do Empreendedor do Estado de Pernambuco em parceria com o SEBRAE, entre outros. Diante disso, foi proposto um modelo de rede social baseado em um documento de arquitetura de informação, utilizando-se como requisitos às analises identificadas neste estudo, o modelo utilizado neste documento foi o MVC (Modelo, Visão e Controle) como modelo escolhido para desenvolver o sistema. A escolha por tal padrão foi devido às suas características de fácil manutenção, ótimo reuso de códigos, eficiência e segurança para o usuário final; e, por ser um padrão de desenvolvimento orientado a objetos amplamente utilizado no mercado. Por fim, entendeu-se que apesar da quantidade crescente das redes sociais para negócios no Brasil e no mundo, observa-se uma necessidade de soluções mais adequadas e alinhadas às expectativas reais do empreendedor.", 
    "area": "SISTEMAS DE INFORMAÇÃO", 
    "autor": "HENRIQUE DANIEL GOMES PIMENTEL", 
    "data": "25/11/2013", 
    "evaluators": [
        {
            "category": "Participante Externo", 
            "name": "ALEXANDRE MAGNO ANDRADE MACIEL"
        }, 
        {
            "category": "Participante Externo", 
            "name": "GERMANO CRISPIM VASCONCELOS"
        }
    ], 
    "idiom": "PORTUGUES", 
    "ies": "UNIVERSIDADE FEDERAL DE PERNAMBUCO", 
    "keywords_en": null, 
    "keywords_pt": [
        "Redes Sociais", 
        " Negócios", 
        " Empreendedores", 
        " Micro e Pequenas Empresas"
    ], 
    "library": "Biblioteca Central da UFPE", 
    "page_count": "127", 
    "program": "CIÊNCIAS DA COMPUTAÇÃO (25001019062P6)", 
    "researchLine": "COMPUTAÇÃO INTELIGENTE", 
    "researchProjet": null, 
    "sameArea": "Sim", 
    "sensei": "EDSON COSTA DE BARROS CARVALHO FILHO", 
    "sponsors": [], 
    "title": "Investigação de um modelo de rede social para o desenvolvimento das capacidades gerenciais de empreendedores de micro e pequenas empresas no Brasil", 
    "tpExpc": "Empresas", 
    "tpVes": "Empresa Privada", 
    "tpVinc": "CLT", 
    "type_": "DISSERTAÇÃO", 
    "volume": "02"
},
{
    "abstract_en": null, 
    "abstract_pt": "Redução dos custos envolvidos no desenvolvimento de sistemas, aspectos jurídicos e fiscais favoráveis, acesso a mercados globais, acesso a mão de obra especializada e diversidade cultural são algumas das vantagens do desenvolvimento distribuído de software (DDS) que tornam essa prática cada vez mais atraente para empresas de desenvolvimento de software. Da mesma forma, a abordagem flexível no gerenciamento de mudanças nos requisitos, a prática de aproximar o cliente do desenvolvedor e a entrega de versões utilizáveis do produto de forma mais frequente, são alguns dos pontos que têm feito crescer o interesse na adoção de práticas ágeis em projetos de DDS. A literatura mostra que um dos fatores críticos para o sucesso desses projetos de DDS é o gerenciamento de riscos. Em resumo, esse trabalho propõe um framework chamado RADS - Risco, Ágil, Distribuído, Software cujo objetivo é auxiliar o gerenciamento de riscos em projetos onde existam equipes geograficamente distribuídas, utilizando técnicas de metodologias ágeis de desenvolvimento de software. Como forma de avaliação do framework proposto, foi aplicado um questionário a profissionais com experiência em projetos de DDS e projetos que utilizam metodologias ágeis. O resultado da avaliação mostrou que o framework desenvolvido pode agregar valor ao gerenciamento de riscos nessa categoria específica de projetos.", 
    "area": "SISTEMAS DE INFORMAÇÃO", 
    "autor": "JEFFERSON FERREIRA BARBOSA", 
    "data": "28/11/2013", 
    "evaluators": [
        {
            "category": "Docente", 
            "name": "HERMANO PERRELLI DE MOURA"
        }, 
        {
            "category": "Participante Externo", 
            "name": "LUCIANA DE QUEIROZ LEAL GOMES"
        }
    ], 
    "idiom": "PORTUGUES", 
    "ies": "UNIVERSIDADE FEDERAL DE PERNAMBUCO", 
    "keywords_en": null, 
    "keywords_pt": [
        "Engenharia de Software", 
        " Gerenciamento de Projetos de Software", 
        " Gerenciamento de Riscos", 
        " Desenvolvimento Distribuído de Software", 
        " Gerenciamento de Projetos Ágeis."
    ], 
    "library": "Biblioteca Central da UFPE", 
    "page_count": "126", 
    "program": "CIÊNCIAS DA COMPUTAÇÃO (25001019062P6)", 
    "researchLine": "ENGENHARIA DE SOFTWARE", 
    "researchProjet": null, 
    "sameArea": "Sim", 
    "sensei": "ALEXANDRE MARCOS LINS DE VASCONCELOS", 
    "sponsors": [], 
    "title": "Um Framework para Gerenciamento de Riscos em Projetos Ágeis de Desenvolvimento Distribuído de Software", 
    "tpExpc": "Outros", 
    "tpVes": "Empresa Pública ou Estatal", 
    "tpVinc": "Servidor Público", 
    "type_": "DISSERTAÇÃO", 
    "volume": "02"
},
{
    "abstract_en": null, 
    "abstract_pt": "A área de Gestão de Projetos (GP) cresce exponencialmente e, com isso, cria oportunidades de trabalho. Junto a essa expansão surge a necessidade de profissionais atualizados e conscientes da realidade, com habilidades e competências renovadas. Uma preparação mais detalhada e formalizada potencializa maiores chances de sucesso, caso seja efetivada. Por outro lado, em um cenário globalizado e cada vez mais competitivo, as empresas precisam buscar profissionais qualificados e experientes para gerir seus projetos. Nessa direção, a ampliação do Ensino Superior no Brasil, trouxe possibilidades de acesso à graduação e diversificou a oferta de novos cursos e modalidades. Assim, a presente pesquisa objetiva a criação de um Curso Superior de Tecnologia (CST) em Gestão de Projetos através da construção coletiva de uma proposição curricular. Para tanto, este estudo foi embasado em pesquisa quantiqualitativa, possibilitando um número maior de recursos para a operacionalização do mesmo, tendo como métodos as pesquisas bibliográfica e de campo. A primeira, por meio de fundamentação e orientação permitiu responder o ponto principal desta Dissertação. A segunda constituiu-se na busca por conhecimentos, críticas e sugestões construtivas, tendo como instrumento um questionário misto direcionado a profissionais específicos de Gestão de Projetos que com seus domínios na área não só colaboraram para esta como também deram credibilidade ao responderem com propriedade. Da coleta de dados foram obtidos os insumos que nortearam o desenvolvimento da proposição curricular, ressaltando que, apesar da relevância do contributo para a Educação em Gestão de Projetos, esta proposição não se configura em uma versão definitiva, tampouco apta para a implantação, mas \u0093apenas\u0094 uma centelha inicial promotora de reflexões, discussões e melhoramentos na área a que se destina. Palavras-chave: Gestão de Projetos; Ensino Superior; Proposição Curricular.", 
    "area": "SISTEMAS DE INFORMAÇÃO", 
    "autor": "VITOR ABILIO SOBRAL DIAS AFONSO", 
    "data": "28/11/2013", 
    "evaluators": [
        {
            "category": "Docente", 
            "name": "ALEXANDRE MARCOS LINS DE VASCONCELOS"
        }, 
        {
            "category": "Participante Externo", 
            "name": "LUCIANA DE QUEIROZ LEAL GOMES"
        }
    ], 
    "idiom": "PORTUGUES", 
    "ies": "UNIVERSIDADE FEDERAL DE PERNAMBUCO", 
    "keywords_en": null, 
    "keywords_pt": [
        "Gestão de Projetos; Ensino Superior; Proposição Curricular"
    ], 
    "library": "Biblioteca Central da UFPE", 
    "page_count": "115", 
    "program": "CIÊNCIAS DA COMPUTAÇÃO (25001019062P6)", 
    "researchLine": "ENGENHARIA DE SOFTWARE", 
    "researchProjet": null, 
    "sameArea": "Sim", 
    "sensei": "HERMANO PERRELLI DE MOURA", 
    "sponsors": [], 
    "title": "Educação em Gestão de Projetos: Uma Proposta para o Ensino Superior Brasileiro", 
    "tpExpc": "Ensino e Pesquisa", 
    "tpVes": "Empresa Pública ou Estatal", 
    "tpVinc": "Servidor Público", 
    "type_": "DISSERTAÇÃO", 
    "volume": "02"
},
{
    "abstract_en": null, 
    "abstract_pt": "A proposta apresenta, inicialmente, os antecedentes históricos de gerenciamento de projetos públicos, com uso de método já conhecidos como Quadro lógico e Método ZOPP, e temas mais recentes como Design Thinking e Project Model Canvas neste context de projetos de desenvolvimento, bem como analisa as técnicas utilizadas. Busca-se assim compreender a lógica de funcionamento para concepção de proposta de framework denominado PM4Gov( Project Managmente for Governement),utilizando a parte de metódos ja conhecidos com novas abordagens. Além disso, são identificadas e analisadas as possiveis interfaces com uma metodogia mais formal, como o Methodare Basic. Finalmente, na proposta do framework observa-se o conjunto de técnicas sistematizadas para a elaboração participativa, coletiva e compartilhada do plano e do processo de gestão, conforme abordagens sugeridas no Design Thinking, pois em projetos de desenvolvimentos públicos a participaçao dos envolvidos e muitas vezes beneficiados diretos com intervenção podem ser um dos principais fatores de sucesso. E mesmo como a proposta de trabalho, o PM4Gov na sua formação original, esperasse que sirva como base para futuras derivações, suas adaptações e apropriações feitas ao longo do tempo.", 
    "area": "SISTEMAS DE INFORMAÇÃO", 
    "autor": "CARLOS EDUARDO FREIRE GURGEL", 
    "data": "03/12/2013", 
    "evaluators": [
        {
            "category": "Docente", 
            "name": "ADRIANO LORENA INACIO DE OLIVEIRA"
        }, 
        {
            "category": "Participante Externo", 
            "name": "DECIO FONSECA"
        }
    ], 
    "idiom": "PORTUGUES", 
    "ies": "UNIVERSIDADE FEDERAL DE PERNAMBUCO", 
    "keywords_en": null, 
    "keywords_pt": [
        "Gestão de Projetos \u0096 Setor Público \u0096 Projeto de Desenvolvimento \u0096 Design Thinking"
    ], 
    "library": "Biblioteca Central da UFPE", 
    "page_count": "128", 
    "program": "CIÊNCIAS DA COMPUTAÇÃO (25001019062P6)", 
    "researchLine": "ENGENHARIA DE SOFTWARE", 
    "researchProjet": null, 
    "sameArea": "Sim", 
    "sensei": "HERMANO PERRELLI DE MOURA", 
    "sponsors": [], 
    "title": "PM4Gov \u0096 Um framework para gestão de projetos públicos de desenvolvimento", 
    "tpExpc": "Empresas", 
    "tpVes": "Empresa Privada", 
    "tpVinc": "CLT", 
    "type_": "DISSERTAÇÃO", 
    "volume": "02"
},
{
    "abstract_en": null, 
    "abstract_pt": "A escalabilidade de uma aplicação de vital importância para o sucesso de um negócio, sendo considerado um dos atributos mais importantes das aplicações atualmente. A plataforma de computação na nuvem, em particular o modelo de infraestrutura como serviço é vantajosa por proporcionar um baixo investimento inicial em infraestrutura inicial e escala conforme demanda. Entre essas plataformas destaca-se a Amazon Web Services, que entre diversas vantagens oferece serviços onde é possível definir gatilhos de escalabilidade que podem gerar desde simples alertas até a execução ações em conjunto com outras ferramentas da própria plataforma. Para se usufruir das vantagens oferecidas pelo ambiente computação na nuvem os administradores de sistema tem a difícil tarefa de definir o servidor adequado assim como estimar o momento certo de escalar a estrutura para atender as necessidades garantindo eficiência na alocação de recursos. Por depender de diversas variáveis e particularidades de cada aplicação, essa tarefa é complexa até mesmo para profissionais experientes. Este trabalho propõe uma ferramenta de auxílio para a definição do tipo de instância adequado e dos gatilhos de escalabilidade de banco de dados no ambiente da Amazon Web Services. A principal contribuição desta ferramenta, chamada Upper, é facilitar o trabalho do administrador de sistema, possibilitando-o executar testes de carga no ambiente da Amazon AWS e definir métricas a serem atendidas em determinados perfis de instâncias de servidores. O Upper é responsável por instanciar um servidor no ambiente seguindo as especificações definidas pelo usuário, monitorar o atendimento das métricas de escalabilidade, e caso em algum momento a métrica não seja atendida , capturar o estado dos recursos do servidor no e buscar o melhor perfil de instância para a atender performance desejada.", 
    "area": "SISTEMAS DE INFORMAÇÃO", 
    "autor": "PAULO LINS RODRIGUES JUNIOR", 
    "data": "09/12/2013", 
    "evaluators": [
        {
            "category": "Docente", 
            "name": "VINICIUS CARDOSO GARCIA"
        }, 
        {
            "category": "Participante Externo", 
            "name": "RODRIGO ELIA ASSAD"
        }
    ], 
    "idiom": "PORTUGUES", 
    "ies": "UNIVERSIDADE FEDERAL DE PERNAMBUCO", 
    "keywords_en": null, 
    "keywords_pt": [
        "Banco de Dados", 
        " Computação na nuvem", 
        " Métricas", 
        " Escalabilidade"
    ], 
    "library": "Biblioteca Central da UFPE", 
    "page_count": "65", 
    "program": "CIÊNCIAS DA COMPUTAÇÃO (25001019062P6)", 
    "researchLine": "COMPUTAÇÃO INTELIGENTE", 
    "researchProjet": null, 
    "sameArea": "Sim", 
    "sensei": "CLEBER ZANCHETTIN", 
    "sponsors": [], 
    "title": "Upper: Uma ferramenta para escolha de servidor e estimação de gatilhos de escalabilidade de banco de dados relacionais na plataforma Amazon AWS", 
    "tpExpc": "Empresas", 
    "tpVes": "Empresa Privada", 
    "tpVinc": "CLT", 
    "type_": "DISSERTAÇÃO", 
    "volume": "02"
},
{
    "abstract_en": null, 
    "abstract_pt": "Segundo tipo mais frequente no mundo, o câncer de mama é mais comum entre as mulheres respondendo, no Brasil, por 52.680 casos diagnosticados em 2012 e 12.852 mortes em decorrência da doença em 2010. A mamografia é um exame de diagnóstico por imagem que tem como finalidade estudar o tecido mamário como, por exemplo, as anormalidades na mama. A imagem mamográfica pode ser dividida em duas regiões com características diferentes, o background ou região de fundo que não foi exposta aos raios-X e a região da mama propriamente atingida. Em uma mamografia, a região limite entre a mama e seu background também conhecida como borda, fronteira ou contorno é uma importante área a ser detectada na imagem. No entanto, no processamento de imagem, a extração do contorno da mama e a segmentação do tecido é uma tarefa desafiadora em muitos aspectos. Os avanços tecnológicos na área de médica proporcionaram a criação dos sistemas de detecção auxiliada por computador (CAD - Computer- Aided Diagnosis) que vêm ajudando os radiologistas, principalmente os radiologistas júnior, na difícil atividade de avaliação e análise de estruturas de interesse nas imagens mamográficas, como as bordas, utilizando-se para isso de técnicas de processamento de imagens. Este trabalho tem como objetivo o estudo das técnicas de processamento de imagem de mamografias aprimorando os conhecimentos sobre segmentação de imagem com a busca de aplicações relacionadas a encontrar a borda da imagem, bem como, o desenvolvimento de um algoritmo de segmentação das imagens que agrupa diversas operações do processamento de imagem, como especificação de histograma, re-amostragem, ajuste de histograma, aritmética e operações morfológicas. Nesta dissertação, alcançou-se uma segmentação correta em 97% das imagens de mamografia processadas. O novo algoritmo objetiva aumentar a visibilidade sobre as novas técnicas de segmentação de imagens mamográfica de uma forma automatizada e robusta a ruído que se apresentam corriqueiramente na aquisição e transmissão das imagens.", 
    "area": "SISTEMAS DE INFORMAÇÃO", 
    "autor": "THIAGO GONCALVES TENORIO", 
    "data": "22/11/2013", 
    "evaluators": [
        {
            "category": "Docente", 
            "name": "GEORGE DARMITON DA CUNHA CAVALCANTI"
        }, 
        {
            "category": "Participante Externo", 
            "name": "ADEMIR DE JESUS AMARAL"
        }
    ], 
    "idiom": "PORTUGUES", 
    "ies": "UNIVERSIDADE FEDERAL DE PERNAMBUCO", 
    "keywords_en": null, 
    "keywords_pt": [
        "Processamento de Imagens", 
        " Segmentação de Imagens", 
        " Mamografias Digitais"
    ], 
    "library": "Biblioteca Central da UFPE", 
    "page_count": "57", 
    "program": "CIÊNCIAS DA COMPUTAÇÃO (25001019062P6)", 
    "researchLine": "COMPUTAÇÃO INTELIGENTE", 
    "researchProjet": null, 
    "sameArea": "Sim", 
    "sensei": "CARLOS ALEXANDRE BARROS DE MELLO", 
    "sponsors": [], 
    "title": "Um novo algoritmo para segmentação de imagens de mamografias robusto a ruído", 
    "tpExpc": "Empresas", 
    "tpVes": "Empresa Privada", 
    "tpVinc": "CLT", 
    "type_": "DISSERTAÇÃO", 
    "volume": "02"
},
{
    "abstract_en": null, 
    "abstract_pt": "O propósito deste estudo é verificar o nível de capacitação para o conhecimento do Núcleo de tecnologia da informação da universidade federal de Pernambuco, identificando as práticas, adotada pela empresa estudada. Para isso foi feita uma pesquisa baseada nas sete dimensões descritas no trabalho do Dr. José Claudio Cyrineu Terra, e observado o desenvolvimento de cada um destes na instituição. Foi utilizada uma abordagem qualitativa, em um estudo de caso, cujos atores foram os funcionários do Núcleo de Tecnologia. Os resultados obtidos demonstraram que o núcleo de tecnologia avaliado ainda carece de gestões mais profissionais, necessita valorizar seus funcionários, instilar neles a visão do conhecimento, gerenciar e estimular as conversas, mobilizar ativistas do conhecimento, criar o contexto adequado para a produção e disseminação do conhecimento, e globalizá-lo; para conseguir assim a concretização do seu planejamento estratégico definido para o período de 2011 a 2015. Palavras-chave: Capacitação para o conhecimento, gestão do conhecimento, Núcleo de tecnologia da informação.", 
    "area": "SISTEMAS DE INFORMAÇÃO", 
    "autor": "MANOEL RODOLFO MARINHO DE ANDRADE", 
    "data": "17/04/2013", 
    "evaluators": [
        {
            "category": "Participante Externo", 
            "name": "JULIANA REGUEIRA BASTO DINIZ"
        }, 
        {
            "category": "Participante Externo", 
            "name": "BERNADETTE FARIAS LOSCIO"
        }
    ], 
    "idiom": "PORTUGUES", 
    "ies": "UNIVERSIDADE FEDERAL DE PERNAMBUCO", 
    "keywords_en": null, 
    "keywords_pt": [
        "Capacitação para o conhecimento", 
        " gestão do conhecimento", 
        " Núcleo de tecnologia da informação."
    ], 
    "library": "Biblioteca Central da UFPE", 
    "page_count": "96", 
    "program": "CIÊNCIAS DA COMPUTAÇÃO (25001019062P6)", 
    "researchLine": "COMPUTAÇÃO INTELIGENTE", 
    "researchProjet": null, 
    "sameArea": "Sim", 
    "sensei": "PATRICIA CABRAL DE AZEVEDO RESTELLI TEDESCO", 
    "sponsors": [], 
    "title": "Investigação sobre a gestão do conhecimento no núcleo de Tecnologia da Informação da Universidade Federal de Pernambuco", 
    "tpExpc": "Outros", 
    "tpVes": "Empresa Pública ou Estatal", 
    "tpVinc": "Servidor Público", 
    "type_": "DISSERTAÇÃO", 
    "volume": "02"
},
{
    "abstract_en": null, 
    "abstract_pt": "Neste trabalho apresentamos uma solução para o problema de balanceamento dinâmico nos Sistemas de Compartilhamentos de Bicicletas Públicas, decorrentes das movimentações diárias das bicicletas nas estações de estacionamento. O problema de alocação das bicicletas ocorre especialmente nos horários de pico, nos quais algumas estações de bicicletas possuem maior procura do que outras e se não for feito um remanejamento eficiente entre as estações, estações podem ficar vazias, evitando que os usuários possam retirar bicicletas ou cheias, impedindo a devolução das bicicletas. Este estudo pretende apontar soluções para o problema através da análise de padrões das movimentações de bicicletas. Estas análises permitem previsões do número de bicicletas disponíveis nas estações. Tais previsões irão oferecer um melhor serviço na logística de redistribuições e balanceamento das bicicletas. O presente trabalho investiga metodologias distintas para realizar previsões: séries temporais e algoritmos de classificação. Para este estudo foram utilizados dados do Sistema Bike Rio da cidade do Rio de Janeiro, com informações dos números de bicicletas disponíveis para os usuários em um determinado momento em cada um das estações. O modelo estatístico que melhor se adequou ao conjunto de dados da série temporal foi o ARIMA(2,1,2) e entre os algoritmos de classificação o que apresentou o menor erro de previsão foi o J48. Palavras-chave: Previsão, Séries Temporais, Algoritmos de Classificação", 
    "area": "SISTEMAS DE INFORMAÇÃO", 
    "autor": "EDUARDO HENRIQUE DE MELO LIMA", 
    "data": "09/12/2013", 
    "evaluators": [
        {
            "category": "Docente", 
            "name": "RICARDO BASTOS CAVALCANTE PRUDENCIO"
        }, 
        {
            "category": "Participante Externo", 
            "name": "BYRON LEITE DANTAS BEZERRA"
        }
    ], 
    "idiom": "PORTUGUES", 
    "ies": "UNIVERSIDADE FEDERAL DE PERNAMBUCO", 
    "keywords_en": null, 
    "keywords_pt": [
        "Previsão", 
        " Séries Temporais", 
        " Algoritmos de Classificação"
    ], 
    "library": "Biblioteca Central da UFPE", 
    "page_count": "85", 
    "program": "CIÊNCIAS DA COMPUTAÇÃO (25001019062P6)", 
    "researchLine": "COMPUTAÇÃO INTELIGENTE", 
    "researchProjet": null, 
    "sameArea": "Não", 
    "sensei": "CLEBER ZANCHETTIN", 
    "sponsors": [], 
    "title": "Estudo de Modelos de Predições em um Sistema de Compartilhamento de Bicicletas Público", 
    "tpExpc": "Outros", 
    "tpVes": "Empresa Privada", 
    "tpVinc": "CLT", 
    "type_": "DISSERTAÇÃO", 
    "volume": "02"
},
{
    "abstract_en": null, 
    "abstract_pt": "As metodologias ágeis de desenvolvimento de software emergiram como alternativa para processos prescritivos, os quais são classificados como excessivamente formais. Com objetivo de viabilizar entregas frequentes, processos adaptáveis, flexíveis e focados no cliente, as metodologias ágeis se tornaram referência sobre como produzir software de forma produtiva. Contudo, com objetivo de tornar o processo mais simples, essas abordagens invariavelmente incorrem em problemas como: modelos pouco generalistas para cobrir todo o ciclo de vida da Engenharia de Software; foco em disciplinas específicas do processo de software; subestimação de aspectos relevantes em iniciativas de desenvolvimento, como esforços de arquitetura, design e documentação; e indicação para equipes e projetos de pequena escala. A proposta desta dissertação de mestrado é propor um framework de processo eficiente de desenvolvimento de software, o qual se baseia nos ideários das metodologias ágeis, porém cobre todo o ciclo de vida de projeto desde a concepção, gestão, implementação e entrega. O framework inclui ferramentas como princípios, valores, atividades, artefatos e práticas específicas, incluindo esforços como arquitetura, design e documentação, concebendo um processo ágil, eficiente e extremamente produtivo para projetos de concepção e manutenção software, independentemente da sua escala. Palavras-chave: Engenharia de Software; Metodologias Ágeis; Modelagem Ágil de Software; Scrum; Extreme Programming; Crystal; Dynamic Systems Development Method; Adaptive Software Development; Feature-Driven Development; Behavior-Driven Development e Test-Driven Development.", 
    "area": "SISTEMAS DE INFORMAÇÃO", 
    "autor": "CARLOS DIEGO CAVALCANTI PEREIRA", 
    "data": "18/03/2014", 
    "evaluators": [
        {
            "category": "Docente", 
            "name": "HERMANO PERRELLI DE MOURA"
        }, 
        {
            "category": "Participante Externo", 
            "name": "CRISTINE MARTINS GOMES DE GUSMAO"
        }
    ], 
    "idiom": "PORTUGUES", 
    "ies": "UNIVERSIDADE FEDERAL DE PERNAMBUCO", 
    "keywords_en": null, 
    "keywords_pt": [
        "Engenharia de Software; Metodologias Ágeis; Modelagem Ágil de Software; Scrum; Extreme Programming; Crystal; Dynamic Systems Development Method;"
    ], 
    "library": "Central da UFPE", 
    "page_count": "167", 
    "program": "CIÊNCIAS DA COMPUTAÇÃO (25001019062P6)", 
    "researchLine": "ENGENHARIA DE SOFTWARE", 
    "researchProjet": null, 
    "sameArea": "Não", 
    "sensei": "ALEXANDRE MARCOS LINS DE VASCONCELOS", 
    "sponsors": [], 
    "title": "X-PRO: Um Framework para Desenvolvimento Eficiente de Software Baseado em Metodologias Ágeis", 
    "tpExpc": "-", 
    "tpVes": "-", 
    "tpVinc": "-", 
    "type_": "DISSERTAÇÃO", 
    "volume": "02"
},
{
    "abstract_en": null, 
    "abstract_pt": "No âmbito da biometria comportamental, o reconhecimento automático de assinaturas manuscritas off-line se destacam pela boa aceitação em diversos segmentos, tais como Bancos, Cartórios e Imobiliárias. Dentre os fatores que estimulam sua utilização estão a facilidade na aquisição, pois não depende de equipamentos específicos, e seu valor legal ao ser realizada de próprio punho. No intuito de investigar métodos alternativos para realizar sua verificação automática, esta dissertação testa uma abordagem baseada no Coeficiente de Correlação de Pearson. O experimento foi realizado em cinco etapas; da primeira à terceira, são utilizadas variações na extração de características, sem o auxílio de um classificador baseado em aprendizado automático. No quarto experimento, foi utilizada uma rede neural artificial como classificador, para efeito de comparação com os resultados anteriores. No quinto e último experimento, um peso associado ao limiar de resposta utilizado nos experimentos anteriores foi adicionado objetivando minimizar os efeitos dos falsos positivos obtidos. Os métodos propostos apresentaram resultados promissores em comparação com os resultados apresentados na literatura. Palavras-chave: Assinatura off-line, Inteligência Computacional, Reconhecimento de Padrões, Processamento de Imagens, Coeficiente de Correlação de Pearson", 
    "area": "SISTEMAS DE INFORMAÇÃO", 
    "autor": "DAVI DELGADO CLEROT", 
    "data": "28/04/2014", 
    "evaluators": [
        {
            "category": "Participante Externo", 
            "name": "BYRON LEITE DANTAS BEZERRA"
        }, 
        {
            "category": "Participante Externo", 
            "name": "LEANDRO MACIEL ALMEIDA"
        }
    ], 
    "idiom": "PORTUGUES", 
    "ies": "UNIVERSIDADE FEDERAL DE PERNAMBUCO", 
    "keywords_en": null, 
    "keywords_pt": [
        "Assinatura off-line", 
        " Inteligência Computacional", 
        " Reconhecimento de Padrões", 
        " Processamento de Imagens", 
        " Coeficiente de Correlação de Pearson"
    ], 
    "library": "Central da UFPE", 
    "page_count": "67", 
    "program": "CIÊNCIAS DA COMPUTAÇÃO (25001019062P6)", 
    "researchLine": "COMPUTAÇÃO INTELIGENTE", 
    "researchProjet": null, 
    "sameArea": "Não", 
    "sensei": "CLEBER ZANCHETTIN", 
    "sponsors": [], 
    "title": "Verificação de Assinaturas Off-line utilizando o Coeficiente de Correlação de Pearson", 
    "tpExpc": "-", 
    "tpVes": "-", 
    "tpVinc": "-", 
    "type_": "DISSERTAÇÃO", 
    "volume": "02"
},
{
    "abstract_en": null, 
    "abstract_pt": "Há uma tendência das organizações que atuam no desenvolvimento e manutenção de software em utilizarem Pontos de Função como medida padrão em seus processos de medição. Atualmente a análise de pontos de função é a técnica mais utilizada entre as organizações brasileiras. Por outro lado, o COSMIC é uma técnica de medição considerada como a segunda geração em método de medição funcional de projetos de desenvolvimento e manutenção de software, sendo precisa e abrangente para medir software e estimar esforço de desenvolvimento, despertando o interesse do mercado de desenvolvimento de software por essa métrica. Quando considerada a migração das bases históricas de medição de software das organizações para uma nova unidade de medida, há como consequência um alto custo para se medir os projetos legados. Nesse sentido, o objetivo desse trabalho é propor uma alternativa para migração de bases históricas de Pontos de Função para o COSMIC. A abordagem propõe um fator de conversão, o qual foi encontrado a partir da medição de quatro projetos de desenvolvimento de software analisados nessas duas técnicas, para atualizar seus dados sem o custo de refazer toda sua base histórica. Palavras-chave: Gerenciamento de Projetos, Métricas, Medição de Software, APF, Pontos de Função e COSMIC.", 
    "area": "SISTEMAS DE INFORMAÇÃO", 
    "autor": "FELIPE DE OLIVEIRA BARBALHO", 
    "data": "28/04/2014", 
    "evaluators": [
        {
            "category": "Docente", 
            "name": "HERMANO PERRELLI DE MOURA"
        }, 
        {
            "category": "Participante Externo", 
            "name": "CRISTINE MARTINS GOMES DE GUSMAO"
        }
    ], 
    "idiom": "PORTUGUES", 
    "ies": "UNIVERSIDADE FEDERAL DE PERNAMBUCO", 
    "keywords_en": null, 
    "keywords_pt": [
        "Gerenciamento de Projetos", 
        " Métricas", 
        " Medição de Software", 
        " APF", 
        " Pontos de Função e COSMIC."
    ], 
    "library": "Central da UFPE", 
    "page_count": "94", 
    "program": "CIÊNCIAS DA COMPUTAÇÃO (25001019062P6)", 
    "researchLine": "ENGENHARIA DE SOFTWARE", 
    "researchProjet": null, 
    "sameArea": "Sim", 
    "sensei": "ALEXANDRE MARCOS LINS DE VASCONCELOS", 
    "sponsors": [], 
    "title": "Uma Abordagem Comparativa entre duas Técnicas de Medição de Software", 
    "tpExpc": "Empresas", 
    "tpVes": "Empresa Privada", 
    "tpVinc": "CLT", 
    "type_": "DISSERTAÇÃO", 
    "volume": "02"
},
{
    "abstract_en": null, 
    "abstract_pt": "Atualmente, é cada vez mais significativo o número de empresas que estão distribuindo seus processos de desenvolvimento de software ao redor do mundo. Desta forma, tem-se equipes distribuídas, caracterizando assim o desenvolvimento de software distribuído (DDS). Nesse contexto, problemas fundamentais na gerência de projetos são exacerbados quando equipes de desenvolvimento de software estão distribuídas geograficamente. Dentre os problemas, a gerência de projetos destaca-se, distância, diferença de cultura e fuso-horário, bem como dos meios de comunicação disponíveis. Nesse sentido, este trabalho apresenta um estudo de mapeamento sistemático da literatura, o qual utilizou buscas automáticas a partir de seis engenhos de busca de bibliotecas digitais, além de uma busca manual em um periódico. Investigando os desafios, melhores práticas, modelos e ferramentas que possam apoiar a gerência de projetos. Palavras-chave: Desenvolvimento distribuído de software (DDS), Gerência de projetos, Mapeamento sistemático da literatura.", 
    "area": "SISTEMAS DE INFORMAÇÃO", 
    "autor": "JULIANA BRAZ DA COSTA", 
    "data": "29/04/2014", 
    "evaluators": [
        {
            "category": "Participante Externo", 
            "name": "ANDRE LUIS DE MEDEIROS SANTOS"
        }, 
        {
            "category": "Participante Externo", 
            "name": "CRISTINE MARTINS GOMES DE GUSMAO"
        }
    ], 
    "idiom": "PORTUGUES", 
    "ies": "UNIVERSIDADE FEDERAL DE PERNAMBUCO", 
    "keywords_en": null, 
    "keywords_pt": [
        "Desenvolvimento distribuído de software (DDS)", 
        " Gerência de projetos", 
        " Mapeamento sistemático da literatura."
    ], 
    "library": "Central da UFPE", 
    "page_count": "205", 
    "program": "CIÊNCIAS DA COMPUTAÇÃO (25001019062P6)", 
    "researchLine": "ENGENHARIA DE SOFTWARE", 
    "researchProjet": null, 
    "sameArea": "Sim", 
    "sensei": "SERGIO CASTELO BRANCO SOARES", 
    "sponsors": [], 
    "title": "Um Mapeamento Sistemático de Gerenciamento de Projetos no Desenvolvimento Distribuído de Software", 
    "tpExpc": "Ensino e Pesquisa", 
    "tpVes": "Empresa Pública ou Estatal", 
    "tpVinc": "Servidor Público", 
    "type_": "DISSERTAÇÃO", 
    "volume": "02"
},
{
    "abstract_en": null, 
    "abstract_pt": "A adoção da Gestão de Processos de Negócios vem crescendo nos mais diversos tipos de instituições em geral nos últimos anos, principalmente a partir da criação da BPMN como ferramenta gráfica para o desenho dos processos. A BPMN (Business Processo Model and Notation) se destaca dentre várias notações pela sua simplicidade e facilidade de entendimento. Apesar da sua força como notação gráfica a BPMN carece de um formalismo matemático que possa avaliar a eficiência de um determinado fluxo de processo. Por outro lado as redes de Petri como uma notação madura, com forte formalismo matemático, de larga aceitação na descrição de sistemas discretos e bastante popular no meio acadêmico mas pouco conhecida e utilizada entre as pessoas de negócios, não só tem uma notação gráfica eficiente como possui várias formas de avaliação formal de performance dos grafos criados.O presente trabalho vem juntar-se a várias iniciativas de unir essas duas notações para tentar obter o melhor que ambas oferecem, ou seja para ter em mãos tanto a facilidade de uso e entendimento da BPMN quanto o formalismo matemático e simplicidade gráfica das Redes de Petri.Para isso é apresentado um modelo de transformação e seu respectivo protótipo capaz de transformar um diagrama criado com a notação em BPMN para o seu equivalente em um diagrama baseado em redes de Petri, mais especificamente uma GSPN, permitindo, dessa forma que avaliações de correção e análise de performance específicos das redes resultantes sejam aplicados ao processo transformado. Palavras-chave: Negócio, processo, gerenciamento, Notação, Modelo, BPMN, Redes de Petri, transformação, GSPN.", 
    "area": "ENGENHARIA DA COMPUTAÇÃO", 
    "autor": "JESSE JAMES MATOS SOARES", 
    "data": "25/04/2014", 
    "evaluators": [
        {
            "category": "Participante Externo", 
            "name": "FERNANDO ANTONIO AIRES LINS"
        }, 
        {
            "category": "Participante Externo", 
            "name": "PAULO ROMERO MARTINS MACIEL"
        }
    ], 
    "idiom": "PORTUGUES", 
    "ies": "UNIVERSIDADE FEDERAL DE PERNAMBUCO", 
    "keywords_en": null, 
    "keywords_pt": [
        "Negócio", 
        " processo", 
        " gerenciamento", 
        " Notação", 
        " Modelo", 
        " BPMN", 
        " Redes de Petri", 
        " transformação", 
        " GSPN"
    ], 
    "library": "Central da UFPE", 
    "page_count": "162", 
    "program": "CIÊNCIAS DA COMPUTAÇÃO (25001019062P6)", 
    "researchLine": "REDES DE COMPUTADORES", 
    "researchProjet": null, 
    "sameArea": "Sim", 
    "sensei": "RICARDO MASSA FERREIRA LIMA", 
    "sponsors": [], 
    "title": "Uma abordagem para a transformação da notação BPMN para a notação de Redes de Petri", 
    "tpExpc": "Outros", 
    "tpVes": "Empresa Pública ou Estatal", 
    "tpVinc": "Servidor Público", 
    "type_": "DISSERTAÇÃO", 
    "volume": "02"
},
{
    "abstract_en": null, 
    "abstract_pt": "A explosão de dados na internet deixou de ser palco apenas de grandes empresas para ser amplamente utilizada por usuários comuns. Esse crescimento exagerado traz consigo grandes desafios em relação à disponibilização da informação. A natureza descentralizada e desestruturada na qual esses dados estão disponíveis tornam a tarefa de encontrar, analisar e sintetizar comentários sobre uma dada empresa, produto ou serviço extremamente complicada, ocasionando resultados de baixa qualidade. Esta pesquisa tem como foco a extração de informação de textos livres gerados pela rede social Twitter, onde na maioria das vezes apresentam uma estrutura linguística irregular. Dentre os diversos trabalhos relacionados à extração de informação podemos destacar o Reconhecimento de Entidades Mencionadas (REM), cujo objetivo consiste em localizar e classificar elementos do texto em categorias pré-definidas como Organizações, Pessoas, Local, etc. Neste trabalho será considerada apenas a categoria Organização, com ênfase em palavras homonímias. Este experimento foi dividido em dois cenários diferentes. Ambos utilizam as mesmas características, a diferença entre os cenários é que no primeiro exige o conhecimento do especialista para determinar todos os atributos considerados relevantes para o aprendizado supervisionado. No segundo cenário, um processo automatizado define parte desses atributos. Os experimentos foram realizados usando a ferramenta Weka onde foram avaliados os classificadores: Bayesianos, Máquinas de Vetores de Suporte (SVM), K-Vizinhos mais Próximos e Árvores de Decisão. Como medidas de desempenho foram analisadas as taxas de precisão, cobertura e medida-F. Apesar dos dados estatísticos apresentados pelos classificadores se mostrarem bastante aproximados, o algoritmo do K-Vizinhos mais Próximos obteve em boa parte dos testes melhores resultados. Nos dois cenários os resultados chegaram próximos um do outro, porém o primeiro cenário obteve melhores taxas. Palavras-chave: Classificação de textos, Reconhecimento de Entidades Mencionadas, Entidades Organizacionais, Weka.", 
    "area": "SISTEMAS DE INFORMAÇÃO", 
    "autor": "DANIELLE GUEDES FRUTUOSO", 
    "data": "28/04/2014", 
    "evaluators": [
        {
            "category": "Participante Externo", 
            "name": "RENATO FERNANDES CORREA"
        }, 
        {
            "category": "Participante Externo", 
            "name": "LEANDRO MACIEL ALMEIDA"
        }
    ], 
    "idiom": "PORTUGUES", 
    "ies": "UNIVERSIDADE FEDERAL DE PERNAMBUCO", 
    "keywords_en": null, 
    "keywords_pt": [
        "Classificação de textos", 
        " Reconhecimento de Entidades Mencionadas", 
        " Entidades Organizacionais", 
        " Weka."
    ], 
    "library": "Central da UFPE", 
    "page_count": "86", 
    "program": "CIÊNCIAS DA COMPUTAÇÃO (25001019062P6)", 
    "researchLine": "COMPUTAÇÃO INTELIGENTE", 
    "researchProjet": null, 
    "sameArea": "Não", 
    "sensei": "RICARDO BASTOS CAVALCANTE PRUDENCIO", 
    "sponsors": [], 
    "title": "Recuperação de Informação e Classificação de Entidades Organizacionais em Textos Não Estruturados", 
    "tpExpc": "-", 
    "tpVes": "-", 
    "tpVinc": "-", 
    "type_": "DISSERTAÇÃO", 
    "volume": "02"
},
{
    "abstract_en": null, 
    "abstract_pt": "Os sistemas de prontuário eletrônico estão cada vez mais presentes no dia a dia dos médicos cardiologistas. A utilização de tais sistemas permite de forma simples que o trabalho dessa classe de profissionais seja realizado de forma mais produtiva e eficiente, agilizando o processo de atendimento, registro e recuperação das informações geradas a partir das consultas dos pacientes. Neste contexto, este trabalho propõe demonstrar o impacto na realização de consultas de médicos cardiologistas com a utilização do módulo de evolução eletrônica de pacientes de um sistema de gestão integrada de clínicas – o Sistema Bravo, versão cardiologia. A metodologia de pesquisa utilizada foi um levantamento (survey) com médicos cardiologistas, utilizando, para análise dos dados, técnicas básicas de análise exploratória de dados quantitativos e qualitativos. O levantamento teve um universo de 30 médicos cardiologistas que compõe o quadro clínico de duas importantes clínicas cardiológicas da cidade do Recife, no estado de Pernambuco. Os médicos cardiologistas participantes responderam a um questionário contendo dez perguntas de múltipla escolha, com o objetivo de captar os benefícios percebidos por esse público com o uso do sistema de gestão integrada de clínicas cardiológicas em seu trabalho, e duas perguntas descritivas objetivando: (i) coletar informação sobre benefícios não contemplados nas dez perguntas iniciais e (ii) captar críticas e sugestões para melhoria do Sistema Bravo. Palavras-chave : Sistemas de Informação, Prontuário Eletrônico do Paciente, Produtividade.", 
    "area": "SISTEMAS DE INFORMAÇÃO", 
    "autor": "LUIZ AUGUSTO DE AZEVEDO MANZELLA", 
    "data": "10/04/2014", 
    "evaluators": [
        {
            "category": "Docente", 
            "name": "SIMONE CRISTIANE DOS SANTOS LIMA"
        }, 
        {
            "category": "Participante Externo", 
            "name": "FERNANDO GOMES DE PAIVA JUNIOR"
        }
    ], 
    "idiom": "PORTUGUES", 
    "ies": "UNIVERSIDADE FEDERAL DE PERNAMBUCO", 
    "keywords_en": null, 
    "keywords_pt": [
        "Sistemas de Informação", 
        " Prontuário Eletrônico do Paciente", 
        " Produtividade"
    ], 
    "library": "Central da UFPE", 
    "page_count": "69", 
    "program": "CIÊNCIAS DA COMPUTAÇÃO (25001019062P6)", 
    "researchLine": "ENGENHARIA DE SOFTWARE", 
    "researchProjet": null, 
    "sameArea": "Sim", 
    "sensei": "HERMANO PERRELLI DE MOURA", 
    "sponsors": [], 
    "title": "Impacto na realização de consultas de médicos cardiologistas com a utilização do módulo de evolução eletrônica de pacientes de um sistema de gestão integrada de clínicas", 
    "tpExpc": "Empresas", 
    "tpVes": "Empresa Privada", 
    "tpVinc": "CLT", 
    "type_": "DISSERTAÇÃO", 
    "volume": "02"
},
{
    "abstract_en": null, 
    "abstract_pt": "Sistemas de Múltiplos Classificadores (Multiple Classifiers Systems - MCS) se baseiam na ideia de que combinar a opinião de vários especialistas tende a produzir uma decisão de melhor qualidade do que aquela produzida por um único especialista. Diversas técnicas foram desenvolvidas, apresentando pontos fortes e fracos, a depender do contexto em que são usadas. Este trabalho propõe uma arquitetura que se beneficia da complementaridade entre essas técnicas, potencializando seus pontos fortes e mitigando os fracos. A arquitetura proposta divide-se em 3 fases - Treinamento, Poda e Teste. Na fase de treinamento é construído um pool de classificadores, na expectativa de que sejam precisos e diversos. A poda tem por função criar um ensemble mais eficiente a partir do pool original. A fase de teste responde pela classificação final dos padrões de entrada pelo ensemble podado. O modelo proposto foi avaliado em uma aplicação de credit-scoring. Para essa aplicação, adotou-se uma estratégia de treinamento em 2 níveis, que combina métodos tradicionais de amostragem de dados para construção de ensembles que, isoladamente, apresentaram bom desempenho na área de credit scoring. O classificador-base utilizado foi a árvore-de-decisão. O processamento da poda usou o algoritmo de ordenação e seleção de classificadores Orientation-Ordering - OO. A combinação das saídas dos classificadores do ensemble foi realizada pelo majority vote. Os experimentos realizados mostraram que a arquitetura proposta alcançou taxas de acerto que se igualaram ou superaram as atingidas pelos métodos quando usados isoladamente. Esses resultados ainda foram obtidos com ensembles cujos tamanhos eram da ordem de 20% dos pools originais gerados na fase de treinamento. A conclusão é que a arquitetura proposta pode ser aplicada na solução de outros problemas, podendo ser necessária a escolha de métodos e modelos cuja eficiência já tenha sido comprovada na aplicação em questão. Palavras-chave: MCS, Combinação de classificadores, ensembles, comitês, poda de ensembles, árvores-de-decisão, credit scoring, ordenação de classificadores.", 
    "area": "SISTEMAS DE INFORMAÇÃO", 
    "autor": "LUIZ VIEIRA E SILVA FILHO", 
    "data": "17/02/2014", 
    "evaluators": [
        {
            "category": "Docente", 
            "name": "TERESA BERNARDA LUDERMIR"
        }, 
        {
            "category": "Participante Externo", 
            "name": "TIAGO ALESSANDRO ESPINOLA FERREIRA"
        }
    ], 
    "idiom": "PORTUGUES", 
    "ies": "UNIVERSIDADE FEDERAL DE PERNAMBUCO", 
    "keywords_en": null, 
    "keywords_pt": [
        "MCS", 
        " Combinação de classificadores", 
        " ensembles", 
        " comitês", 
        " poda de ensembles", 
        " árvores-de-decisão", 
        " credit scoring", 
        " ordenação de classificadores"
    ], 
    "library": "Central da UFPE", 
    "page_count": "72", 
    "program": "CIÊNCIAS DA COMPUTAÇÃO (25001019062P6)", 
    "researchLine": "COMPUTAÇÃO INTELIGENTE", 
    "researchProjet": null, 
    "sameArea": "Sim", 
    "sensei": "GEORGE DARMITON DA CUNHA CAVALCANTI", 
    "sponsors": [], 
    "title": "Uma arquitetura para combinação de classificadores otimizada por métodos de poda com aplicação em credit scoring", 
    "tpExpc": "Empresas", 
    "tpVes": "Empresa Privada", 
    "tpVinc": "CLT", 
    "type_": "DISSERTAÇÃO", 
    "volume": "02"
},
{
    "abstract_en": null, 
    "abstract_pt": "A transferência de tecnologia é o processo pelo qual a indústria se mantém em constante evolução e competitividade. Esta atividade proporciona um modo em que as empresas possam alcançar maior efetividade no uso de seus recursos, provendo informação e auxílio, que conduz a melhorias em diversas áreas do negócio. Em engenharia de software, o processo tende a ser laborioso, dependente de condução rigorosa e de fatores (ou influenciadores), que geralmente estão inclinados a assumir papel decisivo quando do momento da adoção. Evidência contundente, benefício claro, apoio organizacional e treinamento são alguns dos muitos fatores que podem atuar com protagonismo e mudar o curso da atividade. A parceria entre academia e indústria é propensa a ser uma fonte fértil para inovações tecnológicas de forma a saciar o anseio do mercado e impulsionar a criação de novas ideias e visões renovadas. Este estudo tem como objetivo a coleta e investigação do conhecimento disponível na literatura, de forma sistemática, que tenham relação com fatores que influenciam positiva ou negativamente a transferência de tecnologia entre academia e indústria no campo da engenharia de software, assim como as abordagens existentes. De modo a alcançar o objetivo, foi utilizado, como método de pesquisa, o estudo de mapeamento sistemático. Este mapeamento obteve um total de 6228 estudos, por meio de buscas automatizadas e manuais, dentre os quais 87 estudos primários foram identificados como relevantes e classificados de acordo com as perguntas de pesquisa. Com base na análise realizada, conclui-se que a transferência de tecnologia em engenharia de software é uma atividade que envolve fatores tecnológicos, organizacionais, culturais e sociais e que estes têm influência em todo o processo. Além disso, fatores pouco explorados foram identificados, proporcionando abertura à condução de novos estudos. PALAVRAS-CHAVE: Engenharia de Software, Engenharia de Software Baseada em Evidências, Estudo de Mapeamento Sistemático, Transferência de Tecnologia.", 
    "area": "SISTEMAS DE INFORMAÇÃO", 
    "autor": "RAMON NOBREGA TENORIO", 
    "data": "30/04/2014", 
    "evaluators": [
        {
            "category": "Participante Externo", 
            "name": "MARIA DA CONCEICAO MORAES BATISTA"
        }
    ], 
    "idiom": "PORTUGUES", 
    "ies": "UNIVERSIDADE FEDERAL DE PERNAMBUCO", 
    "keywords_en": null, 
    "keywords_pt": [
        "Engenharia de Software", 
        " Engenharia de Software Baseada em Evidências", 
        " Estudo de Mapeamento Sistemático", 
        " Transferência de Tecnologia."
    ], 
    "library": "Central da UFPE", 
    "page_count": "142", 
    "program": "CIÊNCIAS DA COMPUTAÇÃO (25001019062P6)", 
    "researchLine": "ENGENHARIA DE SOFTWARE", 
    "researchProjet": null, 
    "sameArea": "Não", 
    "sensei": "SERGIO CASTELO BRANCO SOARES", 
    "sponsors": [], 
    "title": "Transferência de Tecnologia entre Academia e Indústria em Engenharia de Software: Um Mapeamento Sistemático", 
    "tpExpc": "-", 
    "tpVes": "-", 
    "tpVinc": "-", 
    "type_": "DISSERTAÇÃO", 
    "volume": "02"
},
{
    "abstract_en": null, 
    "abstract_pt": "Uma vez que o mercado está cada dia mais competitivo, este trabalho vem mostrar a importância do estudo de Gestão de Processos de Negócio, aos profissionais de TI (Tecnologia da Informação), que estarão ou estão no mercado, lidando com processos organizacionais, e sabem da necessidade que os objetivos do negócio têm em ser atendidos. As empresas que querem competir no mercado nos dias atuais buscam por melhores práticas de mercado objetivando a otimização, mapeamento, automação, redução de custos, medição de produtividade, certificações de qualidade, dimensionamento de equipe, entre outros, ou seja, busca-se uma gestão de processo de negócio mais eficiente e eficaz. No intuito de atender estas novas mudanças perceber-se que pouco se fala, ou ainda, pouco se estuda e aborda tópicos sobre a gestão de processo de negócio, BPM, dentro das universidades, e principalmente nos cursos de computação. Assim esse estudo se faz importante, uma vez que se entende que os egressos desses cursos têm como objetivo, em sua formação, o desenvolvimento de sistemas, e para o desenvolvimento de sistemas nos dias de hoje, busca-se atingir os objetivos das organizações e ter um conhecimento dos processos de negócio ponta-a-ponta, para se ter melhores resultados Palavras-chave: Análise de Negócio, Gestão de Processo de Negócio - BPM, TI (Tecnologia da Informação).", 
    "area": "SISTEMAS DE INFORMAÇÃO", 
    "autor": "ROSINETE LIBANIO DOS SANTOS COSTA", 
    "data": "17/03/2014", 
    "evaluators": [
        {
            "category": "Participante Externo", 
            "name": "CRISTINE MARTINS GOMES DE GUSMAO"
        }
    ], 
    "idiom": "PORTUGUES", 
    "ies": "UNIVERSIDADE FEDERAL DE PERNAMBUCO", 
    "keywords_en": null, 
    "keywords_pt": [
        "Análise de Negócio", 
        " Gestão de Processo de Negócio - BPM", 
        " TI (Tecnologia da Informação)."
    ], 
    "library": "Central da UFPE", 
    "page_count": "90", 
    "program": "CIÊNCIAS DA COMPUTAÇÃO (25001019062P6)", 
    "researchLine": "ENGENHARIA DE SOFTWARE", 
    "researchProjet": null, 
    "sameArea": "Sim", 
    "sensei": "RICARDO MASSA FERREIRA LIMA", 
    "sponsors": [], 
    "title": "A importância da abordagem de BPM nos Cursos de TI", 
    "tpExpc": "Ensino e Pesquisa", 
    "tpVes": "Empresa Pública ou Estatal", 
    "tpVinc": "Servidor Público", 
    "type_": "DISSERTAÇÃO", 
    "volume": "02"
},
{
    "abstract_en": null, 
    "abstract_pt": "Este trabalho realiza, por meio de simulações computacionais e dados obtidos em campo, uma avaliação de algoritmos de aprendizagem de máquina baseados em máquinas de vetores de suporte aplicados à predição de sinais de rádio frequência em redes celulares. O desempenho dos algoritmos é comparado a modelos de propagação empíricos tradicionais da literatura, como os modelos de Okumura-Hata, Ericsson 9999 e ECC-33. Diferentes kernels foram testados na implementação dos algoritmos de aprendizagem. Por fim, a melhor configuração (kernel Laplaciano) foi selecionada e aplicada no contexto de geolocalização de terminais móveis em redes celulares. Os resultados obtidos indicaram um erro médio de localização em torno de uma ordem de grandeza menor do que o erro obtido por meio de técnicas de trilateração de potência. Palavras-chave: redes sem fio, modelos de propagação, aprendizagem de máquina, máquina de vetor de suporte, regressão com vetor de suporte , regressão não linear.", 
    "area": "ENGENHARIA DA COMPUTAÇÃO", 
    "autor": "ROBSON DIAS ALVES TIMOTEO", 
    "data": "14/11/2014", 
    "evaluators": [
        {
            "category": "Docente", 
            "name": "TERESA BERNARDA LUDERMIR"
        }, 
        {
            "category": "Participante Externo", 
            "name": "FRANCISCO MADEIRO BERNARDINO JUNIOR"
        }
    ], 
    "idiom": "PORTUGUES", 
    "ies": "UNIVERSIDADE FEDERAL DE PERNAMBUCO", 
    "keywords_en": null, 
    "keywords_pt": [
        "redes sem fio", 
        " modelos de propagação", 
        " aprendizagem de máquina", 
        " máquina de vetor de suporte", 
        " regressão com vetor de suporte ", 
        " regressão não linear."
    ], 
    "library": "Central da UFPE", 
    "page_count": "47", 
    "program": "CIÊNCIAS DA COMPUTAÇÃO (25001019062P6)", 
    "researchLine": "REDES DE COMPUTADORES", 
    "researchProjet": null, 
    "sameArea": "Sim", 
    "sensei": "DANIEL CARVALHO DA CUNHA", 
    "sponsors": [], 
    "title": "Uma Avaliação do Uso de Máquinas de Vetor de Suporte na Predição de Sinais de Rádio Frequência em Redes Celulares", 
    "tpExpc": "Empresas", 
    "tpVes": "Empresa Privada", 
    "tpVinc": "CLT", 
    "type_": "DISSERTAÇÃO", 
    "volume": "02"
},
{
    "abstract_en": "The use of information technology (IT) in the practice of health care is a trend that has been evolving and gaining increasingly space in health area in Brazil and all around the world. In this context, the health informatics, as discussed in literature, is a knowledge field applied to scientific development that uses computer technology to improve health services, fixing problems and assisting in decision-making. Faced with this approach, there is the use of modern IT resources for carrying out distance activities related to health practice at various levels, resulting in activities named telehealth. Aware of benefits brought by health informatics, the federal government proposes IT usage policies in helping to promote and manage health. In this scenario, the Telehealth Center of Federal University of Pernambuco (NUTES-UFPE) provides telehealth services to the population through information systems that support the assistance and diagnose of patients, as well as the continuous education for health professionals. As a measure of monitoring and evaluation of these telehealth services provided by the various telehealth centers, the Ministry of Health established control and monitoring measures through performance indicators, which are collected from the centers and sent to Ministry. With the goal of to get a detailed view of the offered telehealth services and thereby, analyze the exchange of information between systems and departments that execute each service, this research was made a syntactic and semantic details of data to be exchanged between NUTES-UFPE systems, ensuring interoperability between them to do the collect of indicators for each telehealth service. So, as a research strategy, a case study was realized with the premise of the use of Business Process Management (BPM) in order to map the NUTES-UFPE business processes. This research describes the application of this case study that resulted in a feasibility of the interoperability between systems and improvements of the information exchange, collection and dispatch of indicators for monitoring and evaluation of telehealth services.", 
    "abstract_pt": "A utilização da tecnologia da informação (TI) na prática da atenção à saúde é uma tendência no Brasil e no mundo. Neste contexto, o campo de conhecimento informática em saúde tem sido aplicado ao desenvolvimento científico que utiliza a informática para melhor oferecer serviços à saúde, resolvendo problemas e auxiliando na tomada de decisão. Diante dessa abordagem, temos o uso dos modernos recursos da TI para realização de atividades a distância relacionadas à prática de saúde em seus diversos níveis, resultando assim em atividades denominadas de telessaúde. Ciente dos benefícios trazidos pela informática em saúde, o governo federal propõe políticas de utilização da TI no auxílio à promoção e gestão da saúde. Neste cenário, o Núcleo de Telessaúde da Universidade Federal de Pernambuco (NUTES-UFPE) oferece serviços de telessaúde para a população, através de sistemas de informação que auxiliam a assistência e diagnóstico do paciente, bem como a formação contínua do profissional de saúde. Como medida de monitoramento e avaliação desses serviços de telessaúde, o Ministério da Saúde (MS) instituiu medidas de controle e monitoramento através de indicadores de desempenho, os quais são coletados dos núcleos e enviados ao MS. Com o objetivo de obter uma visão detalhada dos serviços de telessaúde ofertados e com isso, analisar a troca de informação entre sistemas e departamentos que executam cada serviço, nessa pesquisa foi realizado um detalhamento sintático e semântico dos dados a serem trocados entre os sistemas do NUTES-UFPE, garantindo a interoperabilidade entre eles para efetuar a coleta dos indicadores de cada serviço de telessaúde. Desta forma, como estratégia de pesquisa, foi realizado um estudo de caso tomando como premissa a utilização da abordagem da Gestão de Processos de Negócio (do inglês, Business Process Management- BPM) para mapear os processos de negócio do NUTES-UFPE. A presente pesquisa descreve a aplicação desse estudo de caso que teve como resultado a viabilização da interoperabilidade entre os sistemas e melhorias na troca de informação, coleta e envio dos indicadores de monitoramento e avaliação dos serviços de telessaúde.", 
    "area": "", 
    "autor": "DANILO FARIAS SOARES DA SILVA", 
    "data": "31/08/2015", 
    "evaluators": [
        {
            "category": "Participante Externo", 
            "name": "PAULA REJANE BESERRA DINIZ"
        }, 
        {
            "category": "Docente", 
            "name": "CARINA FROTA ALVES"
        }
    ], 
    "idiom": "PORTUGUES", 
    "ies": "UNIVERSIDADE FEDERAL DE PERNAMBUCO", 
    "keywords_en": null, 
    "keywords_pt": [
        "Telessaúde", 
        " Interoperabilidade", 
        " Gestão de Processos de Negócio."
    ], 
    "library": "", 
    "page_count": "134", 
    "program": "CIÊNCIAS DA COMPUTAÇÃO (25001019062P6)", 
    "researchLine": "", 
    "researchProjet": null, 
    "sameArea": "Não", 
    "sensei": "RICARDO MASSA FERREIRA LIMA", 
    "sponsors": [], 
    "title": "BPM e Interoperabilidade entre sistemas: apoiando a coleta de dados dos serviços de telessaúde", 
    "tpExpc": "-", 
    "tpVes": "-", 
    "tpVinc": "-", 
    "type_": "DISSERTAÇÃO", 
    "volume": "1"
},
{
    "abstract_en": "Created by Dan North, BDD (Behavior Driven Development) is an agile development technique based on TDD (Test Driven Development). It is a test methodology based on behaviors, that is, it concentrates on the reasons why a software is created, on its domain business behavior. It encourages the participation of everyone interested on the software project, not just the technical staff. Although all the benefits allowed by BDD, it does not have such a great market as the TDD, and it is, many times, preferred in relation to the last one. What characteristics should be part of a tool so it can facilitate and streamline the use of BDD in the context of a software development project? How can it be used by an unexperienced client on tests, and, at the same time, add value to the project manager, testers and software developers? How the customer could follow, in real time, if what he expects to, is really being built? How to measure the impact of the tool? Through analysis and results obtained from over twelve (12) years of professional experience in the technology sector of public and private institutions; as well as research in the literature, testimonials and case studies of professionals, the BDD scenario was evaluated and, as result, the BDD Plugin for Mantis (BDDPM) was created: a tool whose purpose is to facilitate the adoption of Behavior Driven Development in software development projects, through features that facilitate its application and enable writing and test tracking by customers. However, only the creation of the tool itself, would not be enough to review the fulfillment of its objectives. It was necessary to understand and know what should be measured to, thereby, raise metrics, take measurements and measure results. In this sense, to evaluate the plugin as proposed solution to the questions raised, a technique called GQM (Goal / Question / Metric) was used. The GQM is an approach that is guided by the goals of an artifact to plan and measure metrics related to them and, by consequence allow the evaluation of the artifact: the BDDPM, in this case. This document describes, in detail, the entire project life cycle: from the designing of BDDPM in its first stages, passing through its creation, the technologies used, available features, etc., until its deployment in a real production environment and its subsequent evaluation of results by the use of GQM technique.", 
    "abstract_pt": "Criado por Dan North, o BDD (Behavior Driven Development) é uma técnica de desenvolvimento ágil de software baseada no TDD (Test Driven Development). Trata-se de uma metodologia de teste de software baseada em comportamentos, isto é, concentra-se nas razões pelo qual o software é criado, nos requisitos de comportamento do negócio. Incentiva a participação de toda pessoa interessada no projeto de software, e não apenas a equipe técnica. Apesar de vários benefícios propiciados pelo BDD, ele não tem uma aceitação tão grande no mercado quanto o TDD, sendo, muitas vezes, preterido em relação a este. Quais características devem fazer parte de uma ferramenta para que ela facilite e dinamize a utilização do BDD no contexto de um projeto de desenvolvimento de software? Como permitir o uso da mesma por um cliente leigo em testes, e, ao mesmo tempo, agregar valor para o gerente do projeto, os testadores e os desenvolvedores de software? Como o cliente poderia acompanhar em tempo real se o que ele espera obter está, de fato, sendo construído? Como medir o impacto da ferramenta? Através de análises e resultados obtidos em mais de 12 (doze) anos de experiência profissional no setor de tecnologia de instituições públicas e privadas, além de pesquisas na literatura, depoimentos e estudos de casos de profissionais da área, avaliou-se o cenário do BDD no mercado e, como fruto dessa avaliação, foi criado o BDD Plugin for Mantis (BDDPM): uma ferramenta cujo objetivo é facilitar a adoção do BDD em projetos de desenvolvimento de software, através de recursos que propiciem sua fácil aplicação e possibilitem a escrita e acompanhamento de testes pelos clientes. Entretanto, apenas a criação da ferramenta em si, não seria suficiente para sua avaliação quanto ao cumprimento dos objetivos. Fazia-se necessário entender e conhecer o que deveria ser medido, para, com isso, levantar métricas, fazer medições e mensurar resultados. Nesse sentido, para avaliar o plugin enquanto proposta de solução para os questionamentos levantados, foi utilizada uma técnica denominada GQM (Goal/Question/Metric). O GQM é uma abordagem que se orienta através dos objetivos de um artefato para planejar e mensurar métricas relacionadas a eles e, consequentemente, permitir a avaliação do artefato: BDDPM, neste caso. Este trabalho descreve, em detalhes, todo o ciclo de vida do projeto, ou seja, desde a concepção do BDDPM em seus primeiros estágios, passando pela sua justificativa, criação, tecnologias utilizadas, recursos incluídos, etc., até sua implantação dentro de um ambiente de produção real e posterior avaliação dos resultados obtidos com a técnica do GQM.", 
    "area": "", 
    "autor": "ALVARO MAGNUM BARBOSA NETO", 
    "data": "22/05/2015", 
    "evaluators": [
        {
            "category": "Docente", 
            "name": "CARLA TACIANA LIMA LOURENCO SILVA SCHUENEMANN"
        }, 
        {
            "category": "Participante Externo", 
            "name": "LEANDRO MARQUES DO NASCIMENTO"
        }
    ], 
    "idiom": "PORTUGUES", 
    "ies": "UNIVERSIDADE FEDERAL DE PERNAMBUCO", 
    "keywords_en": null, 
    "keywords_pt": [
        "Plugin", 
        " BDD", 
        " Mantis", 
        " Testes", 
        " Software", 
        " Projeto", 
        " Desenvolvimento", 
        " GQM", 
        " Análise", 
        " Medição", 
        " Adoção do BDD", 
        " Acompanhamento de Testes", 
        " Escrita de Testes."
    ], 
    "library": "", 
    "page_count": "151", 
    "program": "CIÊNCIAS DA COMPUTAÇÃO (25001019062P6)", 
    "researchLine": "", 
    "researchProjet": null, 
    "sameArea": "Não", 
    "sensei": "VINICIUS CARDOSO GARCIA", 
    "sponsors": [], 
    "title": "Em Direção a um Ambiente de Desenvolvimento de Software Orientado por Comportamento", 
    "tpExpc": "-", 
    "tpVes": "-", 
    "tpVinc": "-", 
    "type_": "DISSERTAÇÃO", 
    "volume": "1"
},
{
    "abstract_en": "In recent years, the Federal Institutes of Education, Science and Technology are going through a constant process of expansion, offering various courses spread over several campuses. Therefore, there is a increasing reliance on information technology resources. Another aspect to note in these institutions is the need to understand how the organizational environment and its management processes work, and provide it with instruments that point, for every moment, which way the institution is treading and also give ways for each responsible in a certain activity within the body can correct any eventual errors with speed, effectiveness and efficiency. An investigation checked the application process of information technologies in the management processes of the brazilian Federal Institutes (FI), in order to identify, analyze and discuss the advantages, limitations, difficulties and main problems found in those FI management processes, so that it contribute to a better development of the activities of final areas of the institutes comprising teaching, research and extension. In this survey, a qualitative and quantitative approach was carried out initially by addressing the technologies of information related to hardware, software, human resources, connectivity and IT governance. Subsequently, management processes and information systems were analyzed for those which support these processes, specifically within the Federal Institute of Education, Science and Technology of Tocantins - IFTO. Thus, the results indicate that there is a great need in relation to software, human resources and IT governance within FIs. The main problem identified in these institutions was related to professionals working in the IT field. In the research conducted in IFTO, it has been identified an urgent need for the institution to complete the development and implementation of its PDTI - Master Plan for Information Technology. The results of this research could assist IFTO in identifying its six macro processes of management, and also point out the need for a Project Management System for the institution. Finally, it has been identified a great need to adopt IT governance practices within IFTO.", 
    "abstract_pt": "Os Institutos Federais de Educação, Ciência e Tecnologia estão passando nos últimos anos por um processo de constante expansão, oferecendo vários cursos distribuídos em diversos campi, consequentemente, a dependência de recursos de tecnologia da informação é cada vez maior. Outro ponto a ser observado nessas instituições é a necessidade de se entender como funciona o ambiente organizacional, os seus processos de gestão, e dotá-las de instrumentos que indiquem, a cada momento, qual caminho a instituição está trilhando e dê meios para que cada responsável em determinada atividade no órgão possa corrigir os eventuais erros com agilidade, eficácia e eficiência. Uma investigação verificou o processo de aplicação das tecnologias da informação nos processos de gestão dos Institutos Federais brasileiros, com o objetivo de identificar, analisar e discutir as vantagens, limitações, dificuldades e os principais problemas encontrados nos referidos processos de gestão dos IFs, e com isso contribuir para um melhor desenvolvimento das atividades das áreas finalísticas dos Institutos que compreende ensino, pesquisa e extensão. Na pesquisa foi realizada uma abordagem qualitativa e quantitativa num primeiro momento, abordando as tecnologias da informação relacionadas a hardwares, softwares, recursos humanos, conectividade e governança de TI. Posteriormente foram analisados os processos de gestão e os sistemas de informação que apoiam os referidos processos, especificamente no Instituto Federal de Educação, Ciência e Tecnologia do Tocantins - IFTO. Desta forma, os resultados apontam que existe uma grande carência em relação a softwares, recursos humanos e governança de TI nos IFs. Sendo que o principal problema identificado nessas instituições revela-se em relação aos profissionais que atuam na área de TI. Na pesquisa realizada no IFTO, identificou-se a urgente necessidade de a instituição concluir a elaboração e colocar em prática o seu PDTI – Plano Diretor de Tecnologia da Informação. Conseguiu-se também com a pesquisa, auxiliar o IFTO na identificação dos seus seis macroprocessos de gestão, e verificou-se que existe a necessidade de um Sistema Gerenciador de Projetos para a instituição. Por fim, observou-se uma grande necessidade da adoção de práticas de governança de TI no IFTO.", 
    "area": "", 
    "autor": "EDILSON LEITE DE SOUSA", 
    "data": "05/06/2015", 
    "evaluators": [
        {
            "category": "Participante Externo", 
            "name": "GERMANO CRISPIM VASCONCELOS"
        }, 
        {
            "category": "Participante Externo", 
            "name": "ANTONIO MAURO BARBOSA DE OLIVEIRA"
        }
    ], 
    "idiom": "PORTUGUES", 
    "ies": "UNIVERSIDADE FEDERAL DE PERNAMBUCO", 
    "keywords_en": null, 
    "keywords_pt": [
        "Tecnologia da Informação", 
        " Macroprocessos e Processos de Gestão", 
        " Institutos Federais", 
        " Sistemas de Informação."
    ], 
    "library": "", 
    "page_count": "142", 
    "program": "CIÊNCIAS DA COMPUTAÇÃO (25001019062P6)", 
    "researchLine": "", 
    "researchProjet": null, 
    "sameArea": "Não", 
    "sensei": "EDSON COSTA DE BARROS CARVALHO FILHO", 
    "sponsors": [], 
    "title": "INVESTIGAÇÃO DO PROCESSO DE APLICAÇÃO DAS TECNOLOGIAS DA INFORMAÇÃO E COMUNICAÇÃO NA GESTÃO DOS INSTITUTOS FEDERAIS DE EDUCAÇÃO, CIÊNCIA E TECNOLOGIA", 
    "tpExpc": "-", 
    "tpVes": "-", 
    "tpVinc": "-", 
    "type_": "DISSERTAÇÃO", 
    "volume": "1"
},
{
    "abstract_en": "Distance Education has increasingly expanded in Brazil due to the evolution of information and communication technologies (ICT). Despite of this dissemination, distance education still has high evasion rates. This occurs, in most cases, due to the sense of isolation faced by the students, for the physical and social presence of the student in virtual educational environments is minimal; the difficulty in collaborating with pairs and the lack of adaptation to methodologies used in distance education. Several studies developed in the area of affective computing indicate that human psychological aspects such as personality, affection and emotion, when used in virtual learning environments, influence the interaction and increase collaboration among students. Based on the literature as well as on interviews conducted with teachers and students of the Instituto Federal da Paraíba (IFPB), this dissertation presents the analysis and the development of a system for recommending people (monitors and tutors) that takes into consideration the context and personality/temperament factors of the students to improve the process of collaboration in distance education. The experiments conducted with students of technical courses in environment, fishing and work safety at IFPB, have shown that the software developed in this work was efficient when the recommendations were generated considering the similarity of personality/temperament among students. Therefore, the results generated by the recommendations were highly rated by participants in this study and revealed that the level of satisfaction and the collaboration in virtual teaching environment improved significantly with the use of Affinity.", 
    "abstract_pt": "A modalidade de ensino a distância (EaD) se expande cada vez mais no Brasil, incentivada pela evolução das tecnologias de informação e comunicação (TIC). Apesar da disseminação da EaD, essa modalidade de ensino ainda apresenta altas taxas de evasão. Esse fato ocorre, na maioria das vezes, pelos seguintes motivos: sentimento de isolamento enfrentado pelos discentes, uma vez que a presença física e social do aluno em ambientes educacionais virtuais é mínima; dificuldade em colaborar com os pares e falta de adaptação às metodologias utilizadas na EaD. Diversos trabalhos desenvolvidos na área da computação afetiva indicam que aspectos psicológicos humanos como personalidade, afetividade e emoção, quando empregados em ambientes virtuais de aprendizagem, influenciam na interação e aumentam a colaboração entre os alunos. Com base na literatura e nas entrevistas efetuadas com professores e alunos do Instituto Federal da Paraíba (IFPB), este trabalho apresenta a análise e o desenvolvimento de um sistema para a recomendação de pessoas (monitores e tutores), observando o contexto e os fatores da personalidade/temperamento dos alunos, a fim de melhorar o processo de colaboração na EaD. Os experimentos realizados com alunos dos cursos técnicos em meio ambiente, pesca e segurança do trabalho do IFPB, comprovaram que o software desenvolvido neste trabalho foi eficiente quando as recomendações foram geradas com base na afinidade da personalidade/temperamento entre os alunos. Dessa forma, os resultados gerados pelas recomendações foram bem avaliados pelos participantes desta pesquisa e revelaram que o índice de satisfação e a colaboração no ambiente virtual de ensino melhoraram com o uso do Affinity.", 
    "area": "", 
    "autor": "ERNANDES SOARES MORAES", 
    "data": "24/07/2015", 
    "evaluators": [
        {
            "category": "Participante Externo", 
            "name": "DANIELLE ROUSY DIAS DA SILVA"
        }, 
        {
            "category": "Docente", 
            "name": "CARLA TACIANA LIMA LOURENCO SILVA SCHUENEMANN"
        }
    ], 
    "idiom": "PORTUGUES", 
    "ies": "UNIVERSIDADE FEDERAL DE PERNAMBUCO", 
    "keywords_en": null, 
    "keywords_pt": [
        "Computação Afetiva; Sistema de Recomendação; Afinidade de Personalidade/Temperamento; Ambiente Virtual de Aprendizagem"
    ], 
    "library": "", 
    "page_count": "89", 
    "program": "CIÊNCIAS DA COMPUTAÇÃO (25001019062P6)", 
    "researchLine": "", 
    "researchProjet": null, 
    "sameArea": "Não", 
    "sensei": "PATRICIA CABRAL DE AZEVEDO RESTELLI TEDESCO", 
    "sponsors": [], 
    "title": "Affinity: um sistema baseado em contexto e afinidade para recomendação de pessoas em ambientes EaD", 
    "tpExpc": "-", 
    "tpVes": "-", 
    "tpVinc": "-", 
    "type_": "DISSERTAÇÃO", 
    "volume": "1"
},
{
    "abstract_en": "Recommender systems have played an important role in different application contexts (e.g recommendation of products, movies, music, books, among others). They automatically suggest each user items that may be relevant, preventing the user having to analyze a huge amount of items to make your choice. Collaborative filtering (CF) is the most popular approach for building recommendation systems, although suffering with sparsity of the data-related issues (eg, users or items with few evaluations). In this study, we investigated the combination of CF techniques represented by matrix factorization technique, and trust-based recommendation techniques (TBR) on social networks to alleviate the problem of data sparseness. TBR systems have in fact proven to be effective to increase the quality of the recommendations, especially for users with few assessments already carried out (e.g., cold start users). However, the relative performance between CF and TBR techniques may depend on the amount of useful information contained in the databases. In the proposed architecture in this work, the predictions generated by CF and TBR techniques are weighted combined through sparsity measures calculated to users and items. To do this, first we define a set of sparsity measures that will be calculated on the matrix of ratings users-items and matrix of trust users-users. Through experiments using Epinions database, we note that the proposed combination brought an improvement in error rates and coverage compared to combined techniques.", 
    "abstract_pt": "Sistemas de recomendação têm desempenhado um papel importante em diferentes contextos de aplicação (e.g recomendação de produtos, filmes, músicas, livros, dentre outros). Eles automaticamente sugerem a cada usuário itens que podem ser relevantes, evitando que o usuário tenha que analisar uma quantidade gigantesca de itens para realizar sua escolha. Filtragem colaborativa (FC) é a abordagem mais popular para a construção de sistemas de recomendação, embora sofra com problemas relacionados à esparsidade dos dados (e.g., usuários ou itens com poucas avaliações). Neste trabalho, investigamos a combinação de técnicas de FC, representada pela técnica de Fatoração de Matrizes, e técnicas de recomendação baseada em confiança (RBC) em redes sociais para aliviar o problema da esparsidade dos dados. Sistemas de RBC têm se mostrado de fato efetivos para aumentar a qualidade das recomendações, em especial para usuários com poucas avaliações realizadas (e.g., usuários novos). Entretanto, o desempenho relativo entre técnicas de FC e de RBC pode depender da quantidade de informação útil presente nas bases de dados. Na arquitetura proposta nesse trabalho, as predições geradas por técnicas de FC e de RBC são combinadas de forma ponderada através de medidas de esparsidade calculadas para usuários e itens. Para isso, definimos inicialmente um conjunto de medidas de esparsidade que serão calculadas sobre a matriz de avaliações usuários-itens e matriz de confiança usuários-usuários. Através de experimentos realizados utilizando a base de dados Epinions, observamos que a proposta de combinação trouxe uma melhoria nas taxas de erro e na cobertura em comparação com as técnicas isoladamente.", 
    "area": "", 
    "autor": "GABRIEL DE ALBUQUERQUE VELOSO AZUIRSON", 
    "data": "06/08/2015", 
    "evaluators": [
        {
            "category": "Docente", 
            "name": "CLEBER ZANCHETTIN"
        }, 
        {
            "category": "Participante Externo", 
            "name": "RENATO FERNANDES CORREA"
        }
    ], 
    "idiom": "PORTUGUES", 
    "ies": "UNIVERSIDADE FEDERAL DE PERNAMBUCO", 
    "keywords_en": null, 
    "keywords_pt": [
        "Sistemas de Recomendação. Filtragem Colaborativa. Fatoração de Matriz. Sistemas de Recomendação Baseados em Confiança. Medidas de Esparsidade."
    ], 
    "library": "", 
    "page_count": "85", 
    "program": "CIÊNCIAS DA COMPUTAÇÃO (25001019062P6)", 
    "researchLine": "", 
    "researchProjet": null, 
    "sameArea": "Não", 
    "sensei": "RICARDO BASTOS CAVALCANTE PRUDENCIO", 
    "sponsors": [], 
    "title": "Investigação da Combinação de Filtragem Colaborativa e Recomendação Baseada em Confiança Através de Medidas de Esparsidade", 
    "tpExpc": "-", 
    "tpVes": "-", 
    "tpVinc": "-", 
    "type_": "DISSERTAÇÃO", 
    "volume": "1"
},
{
    "abstract_en": "The metrics areessential formeasuring the effectiveness of BPMinitiatives, because it is through them that it is possible to check whether the business processes are supporting the organizational strategy, and detect problems of these processes in order to generate improvement and alignment actions. However, organizations still have difficulty knowing what! to!measure,! and!whether!what! is!measured! is! correct.! In! view! of! the! problem,! the! question!was!raised!of!how!was!the!current!scenario!of!implementation!of!BPM!metrics!in! the! context! of! information! technology,! by! the! literature.! For! this! reason,! a! systematic! mapping!was!necessary!to!map!existing!studies!and!reveal!evidence!to!answer!the!research! questions.!Surveys!were!conducted!on!search!engines,!resulting!in!2,860!papers!that!met!the! search!string,!which!were!selected!23!primary!studies,!regarded!as!relevant!by!meet!all!the! criteria! for! inclusion! and! quality! assessment.! The! observation! revealed! a! few! studies! available,! and! in! addition,! there! was! found! some! divergence! between! the! approaches! applied!and!a!lack!of!something!more!structured.!This!paper!laid!out!the!categorization!and! classification! of! the!metric! using! approaches! and! their! applications!mentioned! in! each! of! selected! studies,! followed! by! analysis! of! the! perceived! evidence.! The! contribution! of! this! work! concerns! the! mapping! and! understanding! of! research! gaps! on! BPM! metrics;! the! mapping! the! characteristics! of! the! metrics;! of! the! critical! success! factors! and! used! application! criteria;! and! of! the!main! benefits! and! challenges! encountered! in! each! of! the! approaches.!", 
    "abstract_pt": "As métricas são fundamentais para medição de eficiência e eficácia das iniciativas de BPM, uma vez que é através delas que problemas e melhorias de processos de negócio poderão ser identificados e as ações monitoradas. Porém, as organizações não sabem o que medir, e se o que é medido está correto. Tendo em vista a problemática, foi levantada a questão de como se caracterizavam e eram aplicadas as métricas de BPM no contexto da tecnologia da informação. Ao realizar as primeiras pesquisas, foi detectada uma quantidade baixa de estudos sobre o assunto. Com isto, um mapeamento sistemático fez-se necessário para inspecionar os trabalhos existentes e revelar evidências que respondessem às questões de pesquisa. Pesquisas foram realizadas nos engenhos de busca, de forma automática, resultando em 2861 trabalhos que atenderam à string de busca, no qual foram selecionados 23 estudos primários, considerados como relevantes por atenderem a todos os critérios de inclusão e avaliação da qualidade. Foi observado que, além da confirmação da pouca disponibilização de estudos, existe ainda uma divergência considerável entre as abordagens aplicadas, não havendo algo de fato estruturado, caracterizando ser um dos possíveis problemas pela falta de compreensão para aplicação das métricas nas organizações. Este trabalho dispôs a categorização e classificação das abordagens de utilização das métricas e suas aplicações mencionados em cada um dos estudos selecionados, seguido de análise das evidências percebidas. A contribuição deste trabalho diz respeito ao entendimento das lacunas de pesquisa sobre métricas de BPM; às características de definição e construção das métricas; aos fatores críticos de sucesso e critérios de aplicação utilizados; e aos principais benefícios e desafios encontrados em cada uma das abordagens.", 
    "area": "", 
    "autor": "GISELLE CRISTINA MORENO TAVARES", 
    "data": "18/06/2015", 
    "evaluators": [
        {
            "category": "Participante Externo", 
            "name": "JONES OLIVEIRA DE ALBUQUERQUE"
        }, 
        {
            "category": "Docente", 
            "name": "VINICIUS CARDOSO GARCIA"
        }
    ], 
    "idiom": "PORTUGUES", 
    "ies": "UNIVERSIDADE FEDERAL DE PERNAMBUCO", 
    "keywords_en": null, 
    "keywords_pt": [
        "BPM; Business Process Management; Gerenciamento de Desempenho de Processos; Métricas; Indicadores; Mapeamento Sistemático; Tecnologia da Informação."
    ], 
    "library": "", 
    "page_count": "127", 
    "program": "CIÊNCIAS DA COMPUTAÇÃO (25001019062P6)", 
    "researchLine": "", 
    "researchProjet": null, 
    "sameArea": "Não", 
    "sensei": "SIMONE CRISTIANE DOS SANTOS LIMA", 
    "sponsors": [], 
    "title": "MÉTRICAS EM PROJETOS BPM NO CONTEXTO DE TECNOLOGIA DA INFORMAÇÃO: UM ESTUDO DE MAPEAMENTO SISTEMÁTICO", 
    "tpExpc": "-", 
    "tpVes": "-", 
    "tpVinc": "-", 
    "type_": "DISSERTAÇÃO", 
    "volume": "1"
},
{
    "abstract_en": "Tabular data models have been a lot used for publishing data on the Web because of it is simplicity of representation and easy manipulation. However, some times the data are not disposed in tabular files appropriately, which can cause difficulties in the moment of processing data. Thus, the W3C consortium W3C has been working on a proposal for a standard specification for representing tabular data formats. In this context this work has as main objective to propose a solution to the problem of validation of tabular data files represented by CSV files and described by metadata represented as JSON files, set according to the specification proposed by W3C consortium. The main contribution of this work was the definition of tabular data file validation process and algorithms necessary for the implementation of this process and the implementation of a prototype that aims to do the validation of tabular data as specified by the W3C. Another important contribution was the realization of experiments with data sources available on the web with the objective to evaluate the approach proposed in this paper.", 
    "abstract_pt": "Modelos de dados tabulares têm sido amplamente utilizados para a publicação de dados na Web, devido a sua simplicidade de representação e facilidade de manipulação. Entretanto, nem sempre os dados são dispostos em arquivos tabulares de maneira adequada, o que pode causar dificuldades no momento do processamento dos dados. Dessa forma, o consórcio W3C tem trabalhado em uma proposta de especificação padrão para representação de dados em formatos tabulares. Neste contexto, este trabalho tem como objetivo geral propor uma solução para o problema de validação de arquivos de Dados Tabulares representados por meio de arquivos CSV e descritos por metadados representados na forma de arquivos JSON, definidos de acordo com a especificação proposta pelo W3C. A principal contribuição deste trabalho foi a definição do processo de validação de arquivos de Dados Tabulares e dos algoritmos necessários para a execução desse processo, além da implementação de um protótipo que tem por objetivo realizar a validação dos Dados Tabulares conforme especificado pelo W3C. Outra importante contribuição foi a realização de experimentos com fontes de dados disponíveis na Web com o objetivo de avaliar a abordagem proposta neste trabalho.", 
    "area": "", 
    "autor": "HUGO SANTOS DE OLIVEIRA", 
    "data": "14/08/2015", 
    "evaluators": [
        {
            "category": "Participante Externo", 
            "name": "EDEMBERG ROCHA DA SILVA"
        }, 
        {
            "category": "Docente", 
            "name": "FERNANDO DA FONSECA DE SOUZA"
        }
    ], 
    "idiom": "PORTUGUES", 
    "ies": "UNIVERSIDADE FEDERAL DE PERNAMBUCO", 
    "keywords_en": null, 
    "keywords_pt": [
        "Validação", 
        " CSV", 
        " Metadados", 
        " Dados Tabulares."
    ], 
    "library": "", 
    "page_count": "73", 
    "program": "CIÊNCIAS DA COMPUTAÇÃO (25001019062P6)", 
    "researchLine": "", 
    "researchProjet": null, 
    "sameArea": "Não", 
    "sensei": "BERNADETTE FARIAS LOSCIO", 
    "sponsors": [], 
    "title": "CSVVALIDATION: UMA FERRAMENTA PARA VALIDAÇÃO DE ARQUIVOS CSV A PARTIR DE METADADOS", 
    "tpExpc": "-", 
    "tpVes": "-", 
    "tpVinc": "-", 
    "type_": "DISSERTAÇÃO", 
    "volume": "1"
},
{
    "abstract_en": "Software development projects have become increasingly complex, motivated mainly by the high degree of innovation and technology used. Associated with these elements, the uncertainty, which is characterized by deficiency of information associated to an event, their understanding, their knowledge, their consequence or likelihood, often present in software development projects contributes to the high failure indicators in such projects because traditional approaches in project management do not consider an environment that is unstable and exposed to several sources of uncertainty. This work aims to elaborate a proposal geared to software development organizations to evaluate their competence in managing uncertainty. The evaluation proposal as defined was based on a theoretical study in which a process is advanced to manage the uncertainty in software projects. The construction of the evaluation proposal used the approach GQM (Goal/Question/ Metric), from which were presented metrics to help organizations assess their practices in managing uncertainty in the development process. Through a case study that was developed, the evaluation proposal was demonstrated and applied.", 
    "abstract_pt": "Projetos de desenvolvimento de software têm se tornado cada vez mais complexos, motivados, principalmente, pelo alto grau de inovação e tecnologia empregada. Associado a esses elementos, a incerteza, que é caracterizada pela deficiência de informações relacionadas a um evento, sua compreensão, seu conhecimento, sua consequência, ou sua probabilidade, quase sempre presente em projetos de desenvolvimento de software colabora para os altos indicadores de insucesso em tais projetos, pois as abordagens tradicionais em gerenciamento de projetos não consideram um ambiente instável e sujeito a diversas fontes de incerteza. Esse trabalho tem por objetivo a elaboração de uma proposta, voltada para organizações de desenvolvimento de software, avaliar sua competência em gerir a incerteza. A proposta de avaliação definida foi fundamentada através de um trabalho teórico em que é sugerido um processo para gerir a incerteza em projetos de software. A construção da proposta de avaliação utilizou a abordagem GQM (Goal/Question/Metric), a partir da qual foram apresentadas métricas para auxiliar organizações a avaliarem suas práticas em gerir a incerteza no seu processo de desenvolvimento. Através de um estudo de caso desenvolvido, a proposta de avaliação foi demonstrada e aplicada.", 
    "area": "", 
    "autor": "JOSE ALFREDO SANTOS DE SOUZA", 
    "data": "03/08/2015", 
    "evaluators": [
        {
            "category": "Docente", 
            "name": "SIMONE CRISTIANE DOS SANTOS LIMA"
        }, 
        {
            "category": "Participante Externo", 
            "name": "IVALDIR HONORIO DE FARIAS JUNIOR"
        }
    ], 
    "idiom": "PORTUGUES", 
    "ies": "UNIVERSIDADE FEDERAL DE PERNAMBUCO", 
    "keywords_en": null, 
    "keywords_pt": [
        "gerenciamento de incerteza. projetos de software. incerteza."
    ], 
    "library": "", 
    "page_count": "116", 
    "program": "CIÊNCIAS DA COMPUTAÇÃO (25001019062P6)", 
    "researchLine": "", 
    "researchProjet": null, 
    "sameArea": "Não", 
    "sensei": "HERMANO PERRELLI DE MOURA", 
    "sponsors": [], 
    "title": "AVALIAÇÃO DO GERENCIAMENTO DE INCERTEZAS EM PROJETOS DE SOFTWARE", 
    "tpExpc": "-", 
    "tpVes": "-", 
    "tpVinc": "-", 
    "type_": "DISSERTAÇÃO", 
    "volume": "1"
},
{
    "abstract_en": "Web Services are software components that use open technologies and protocols like XML, SOAP, WSDL and UDDI, to provide its services. Currently, Web Services are an alternative to improve communication between the systems. This dissertation presents a Web Service architectural restructuring – in operation for four years, for the purpose of its service aims to enable DML operations are performed on different databases transparently to users – making use of refactoring and design patterns, ensuring that the factors of quality: maintainability, reliability, efficiency and portability are kept. The objectives proposed can be synthesized in the understanding and characterization of the features and technologies involving Web Services; study and research to find out which design patterns and refactoring can be used in the implementation of the Web Services, enabling this way that good development practices are adopted. We also identify quality factors that can be used in the validation process, as well as we carry out evaluations and testing of Web Service using Open Source tools. Finally, we analyze the results obtained after the use of these standards in the implementation of Web Service are satisfactory. To achieve the proposed was conducted an analysis of the architecture of the Web Service, by means of reverse engineering and code analysis. After this analysis, design patterns and refactoring have been defined and used in the new architecture for the implementation of the new Web Service, in order to provide and ensure the factors of quality: maintainability, reliability, efficiency and portability. Finally, performance testing, load/stress and functional were performed with the help of Open Source tools, JMeter and SoapUI Web Services, two for later results are analyzed The results, after testing and benchmarking between the two Web Services, showed and improvement in the quality of services provided by the Web Service restructured, in addition to providing maintenance cost reduction. Therefore, this study found that refactoring and design patterns can be used in implementing the Web Service.", 
    "abstract_pt": "Os Web Services são componentes de software que se utilizam de tecnologias e protocolos abertos: XML, SOAP, WSDL e UDDI, para fornecer seus serviços. Atualmente, os Web Services surgem como alternativa para melhorar a comunicação entre os sistemas. Esta dissertação apresenta uma reestruturação arquitetural de Web Service - em funcionamento há quatro anos, cuja finalidade do seu serviço visa possibilitar que operações DML sejam realizadas em diferentes bases de dados de forma transparente para os usuários - fazendo uso de refatoração e padrões de projetos, garantindo que os fatores de qualidade: manutenibilidade, confiabilidade, eficiência e portabilidade, sejam mantidos. Os objetivos propostos podem ser sintetizados no entendimento e caracterização das funcionalidades e das tecnologias que envolvem os Web Services; estudos e pesquisas para descobrir quais padrões de projetos e refatoração podem ser utilizados na implementação do Web Services, possibilitando desta forma que boas práticas de desenvolvimento sejam adotadas; definir quais fatores de qualidade podem ser utilizados no processo de validação, além de, realizar avaliações e testes de Web Service fazendo uso de ferramentas Open Source; e finalmente, analisar se os resultados obtidos após o uso destes padrões na implementação do Web Service são satisfatórios. Para alcançar os objetivos propostos foi realizada uma análise da arquitetura do Web Service, por meio da engenharia reversa e análise de código. Após esta análise, refatorações e padrões de projetos foram definidos e utilizados na nova arquitetura para a implementação do novo Web Service, com o intuito de prover e garantir os fatores de qualidade: manutenibilidade, confiabilidade, eficiência e portabilidade. E por fim, testes de desempenho,carga/stress e funcional foram realizados com auxílio de ferramentas Open Source, JMeter e SoapUI, nos dois Web Services, para posteriormente seus resultados serem analisados. Os resultados obtidos, após a realização de teste e avaliação comparativa entre os dois Web Services, demonstraram uma melhora na qualidade dos serviços fornecidos pelo Web Service reestruturado, além de proporcionar redução de custo de manutenção. Assim sendo, este estudo constatou que refatoração e padrões de projetos podem ser utilizados na implementação de Web Service.", 
    "area": "", 
    "autor": "KARINA DA SILVA CORREIA", 
    "data": "27/07/2015", 
    "evaluators": [
        {
            "category": "Participante Externo", 
            "name": "ALEXANDRE CABRAL MOTA"
        }, 
        {
            "category": "Participante Externo", 
            "name": "TIAGO LIMA MASSONI"
        }
    ], 
    "idiom": "PORTUGUES", 
    "ies": "UNIVERSIDADE FEDERAL DE PERNAMBUCO", 
    "keywords_en": null, 
    "keywords_pt": [
        "Web Service. Arquitetura Orientada a Serviços (SOA). Refatoração. Padronização. Padrões de Projetos. Avaliação de Web Service."
    ], 
    "library": "", 
    "page_count": "73", 
    "program": "CIÊNCIAS DA COMPUTAÇÃO (25001019062P6)", 
    "researchLine": "", 
    "researchProjet": null, 
    "sameArea": "Não", 
    "sensei": "MARCIO LOPES CORNELIO", 
    "sponsors": [], 
    "title": "EVOLUÇÃO ARQUITETURAL DE UM WEB SERVICE: TRANSFORMAÇÃO DE CÓDIGO E AVALIAÇÃO DA ARQUITETURA", 
    "tpExpc": "-", 
    "tpVes": "-", 
    "tpVinc": "-", 
    "type_": "DISSERTAÇÃO", 
    "volume": "1"
},
{
    "abstract_en": "Distributed systems have been implemented in a wide variety of application domains, such as Finance and trade with e-commerce systems to buy products over the Internet; Healthcare, such as the use of online electronic medical records and telemedicine to support remote diagnostics or more advanced services, such as remote surgery; Education, which can be highlighted the teaching tools based on the Web, such as virtual environments distance learning; Transportation and Logistics, using geolocation technologies; Environmental stewardship, which uses sensor technology to control and manage the natural environment and thus provide early warning of natural disasters such as earthquakes, floods or tsunamis. Despite of its popularity, there are several challenges that need to be overcomed when we design distributed system, which include heterogeneity and concurrency control. Some of these challenges can be solved using a middleware, which is a connectivity software that encapsulates a set of services that lies on between the application and the operation system. The development of a middleware is a complex task, because it needs at the same time hide the complexity of the concurrency mechanism and the low level communication provided by the operation system from the distributed application, and needs also provide a set of increasing services, such as security service and transaction. To deal with mentioned complexity, middleware system has been design using specified design pattern to build this kind of software. Aside the usage of these design patterns, there is an increase effort to adopt new paradigm of programming to develop middleware softwares, in particular a funcional paradigm. That is because these paradigms natively offer features that deal better with parallelism and concurrency than most of the paradigms present in conventional programming languages. Within this context, the goal of this project is design and develop a middlware called FLiMSy, using Scala as funcional programming language. FLiMSy was developed using middleware’s desing patterns known as Remoting Patterns. To evaluate the proposed implementation, an experiment was conducted in order to measure the response time of FLiMSy and also review the facilities of using purely functional features of Scala in developing a middleware object-oriented.", 
    "abstract_pt": "Sistemas distribuídos têm sido implementados em uma grande diversidade de domínios de aplicação, tais como: Finanças e comércio, com os sistemas de comércio eletrônico para compra de produtos pela Internet; Assistência Médica, que tem como exemplo o uso de prontuários eletrônicos online e a telemedicina no apoio a diagnóstico remoto ou serviços mais avançados, tais como cirurgia remota; Educação, onde podem ser destacadas as ferramentas de ensino baseadas na Web, tais como ambientes virtuais de aprendizagem à distância; Transporte e Logística, que usam tecnologias de localização; Gestão ambiental, que utiliza tecnologia de sensores para controlar e gerenciar o ambiente natural e com isso garantir um alerta precoce de catástrofes naturais, como terremotos, inundações ou tsunamis. Apesar de sua popularidade, existem vários desafios a serem vencidos ao projetar sistemas distribuídos. Dentre eles, podemos citar a heterogeneidade e o controle de concorrência. Alguns desses desafios podem ser solucionados usando-se um middleware, que é um software de conectividade que encapsula um conjunto de serviços e que reside entre a aplicação e o sistema operacional. Os sistemas de middleware permitem ainda que aplicações distintas se comuniquem abstraindo do usuário final como esse processo é realizado. O desenvolvimento de um middleware é uma atividade complexa, pois ao mesmo tempo que ele precisa esconder das aplicações distribuídas a complexidade dos mecanismos de concorrência e comunicação de baixo nível providos pelo sistema operacional, é preciso fornecer um conjunto crescente de serviços, tais como serviços de segurança e transação. Para tratar a complexidade mencionada , sistemas de middleware têm sido projetados com o uso de vários padrões de projeto especificamente definidos para a construção deste tipo de software. Além do uso destes padrões, há um esforço crescente para a adoção de novos paradigmas de programação no desenvolvimento de sistemas de middleware, em particular o paradigma funcional. Isso porque esses paradigmas oferecem nativamente recursos que lidam melhor com paralelismo e concorrência do que a maioria dos paradigmas presentes em linguagens de programação convencionais. Neste contexto, o objetivo deste trabalho é projetar e implementar um middleware, chamado FLiMSy, usando a linguagem de programação funcional Scala. FLiMSy foi projetado utilizando os padrões de projeto de middleware conhecidos como Remoting Patterns. Para avaliar a implementação proposta, foi realizado um experimento com o objetivo de medir o tempo de reposta do FLiMSy e também analisar as facilidades de se usar os recursos puramente funcionais de Scala no desenvolvimento de um middleware orientado a objetos.", 
    "area": "", 
    "autor": "LUIZ ARTUR BOTELHO DA SILVA", 
    "data": "31/07/2015", 
    "evaluators": [
        {
            "category": "Participante Externo", 
            "name": "FERNANDO ANTONIO AIRES LINS"
        }, 
        {
            "category": "Participante Externo", 
            "name": "PAULO ROMERO MARTINS MACIEL"
        }
    ], 
    "idiom": "PORTUGUES", 
    "ies": "UNIVERSIDADE FEDERAL DE PERNAMBUCO", 
    "keywords_en": null, 
    "keywords_pt": [
        "Middleware. Programação Funcional. Scala. Padrões de Projeto."
    ], 
    "library": "", 
    "page_count": "92", 
    "program": "CIÊNCIAS DA COMPUTAÇÃO (25001019062P6)", 
    "researchLine": "", 
    "researchProjet": null, 
    "sameArea": "Não", 
    "sensei": "NELSON SOUTO ROSA", 
    "sponsors": [], 
    "title": "FLIMSY: UM MIDDLEWARE FUNCIONAL EM SCALA", 
    "tpExpc": "-", 
    "tpVes": "-", 
    "tpVinc": "-", 
    "type_": "DISSERTAÇÃO", 
    "volume": "1"
},
{
    "abstract_en": "With the growing popularity of cloud computing model, offering services in each of the layers of Software-as-a-Service (SaaS), Platform-as-a-Service (PaaS) and Infrastructure-as-a-Service (IaaS), began to emerge providers that provide the specific service Database-as-a-Service (DBaaS), whose basic idea is to provide databases in the cloud. However, the impossibility of executing operations, queries and changes on encrypted data in DBaaS services is a factor that keeps customers the possibility to bring your data to the cloud. Owners of data and cloud providers crave fully homomorphic cryptosystems as a solution. But there is no prospect in the short or medium term that these systems can be computationally feasible. Currently research seek to build solutions using viable cryptographic systems that allow the execution of operations on encrypted data on DBaaS provider. One study, precursor and highlighted, bases its solution on a Proxy architecture model, that is no unanimity for this type of solution. This research, based on systematic mapping, search start a deeper discussion of architectural models for DBaaS and presents as main contributions: (i) a catalog of studies with proposed solutions, organized by architectural model, (ii) the determination of a tendency in choosing architectures, considering the state of the art and (iii) an investigation of a concrete direction, pointing advantages and disadvantages, based on cataloged studies, on the adoption of Proxy architecture over cloud computing encrypted solutions to DBaaS and (iv) point to a consistent list of open questions about the solutions for encrypted database, based on data extracted from cataloged studies.", 
    "abstract_pt": "Com a popularização crescente do modelo de computação em nuvem oferecendo serviços em cada uma das camadas de Software-as-a-Service (SaaS), Platform-asa- Service (PaaS) e Infrastructure-as-a-Service (IaaS), começaram a surgir provedores que disponibilizam o serviço específico de Database-as-a-Service (DBaaS), cuja ideia básica é disponibilizar bancos de dados na nuvem. Entretanto, a inviabilidade de execução de operações, consultas e alterações, sobre dados encriptados em serviços DBaaS é um fator que afasta os clientes da possibilidade de levar seus dados para a nuvem. Proprietários de dados e provedores de nuvem anseiam por sistemas criptográficos completamente homomórficos como uma solução. Mas não existe qualquer perspectiva a curto ou médio prazo de que estes sistemas possam ser computacionalmente viáveis. Atualmente pesquisas buscam construir soluções que utilizam sistemas criptográficos viáveis que possibilitem a execução de operações sobre dados encriptados no provedor de DBaaS. Um estudo, precursor e destacado, baseia sua solução em uma arquitetura Proxy, modelo que não é unanimidade para este tipo de solução. Esta pesquisa, baseada em mapeamento sistemático, busca iniciar uma discussão mais profunda sobre modelos de arquitetura para DBaaS e apresenta como principais contribuições: (i) um catálogo de estudos com propostas de soluções, organizado por modelo de arquitetura, (ii) a determinação de uma tendência na escolha de arquiteturas, considerando o estado da arte, (iii) uma investigação de um direcionamento concreto, apontando vantagens e desvantagens, com base nos estudos catalogados, sobre a adoção da arquitetura Proxy em soluções encriptadas de computação em nuvem para DBaaS e (iv) apontar uma lista consistente de questões em aberto acerca das soluções para banco de dados encriptados, com base em dados extraídos dos estudos catalogados.", 
    "area": "", 
    "autor": "MARCELO FERREIRA DE LIMA", 
    "data": "11/08/2015", 
    "evaluators": [
        {
            "category": "Docente", 
            "name": "ROBSON DO NASCIMENTO FIDALGO"
        }, 
        {
            "category": "Participante Externo", 
            "name": "JAIRO SIMIAO DORNELAS"
        }
    ], 
    "idiom": "PORTUGUES", 
    "ies": "UNIVERSIDADE FEDERAL DE PERNAMBUCO", 
    "keywords_en": null, 
    "keywords_pt": [
        "Criptografia. Privacidade. Database-as-a-service. DBaaS. Computação em Nuvem. Arquitetura. Segurança da Informação."
    ], 
    "library": "", 
    "page_count": "115", 
    "program": "CIÊNCIAS DA COMPUTAÇÃO (25001019062P6)", 
    "researchLine": "", 
    "researchProjet": null, 
    "sameArea": "Não", 
    "sensei": "RUY JOSE GUERRA BARRETTO DE QUEIROZ", 
    "sponsors": [], 
    "title": "Soluções para DBaaS com Dados Encriptados: Mapeando Arquiteturas", 
    "tpExpc": "-", 
    "tpVes": "-", 
    "tpVinc": "-", 
    "type_": "DISSERTAÇÃO", 
    "volume": "1"
},
{
    "abstract_en": "ICT governance in the public sector is a framework of initiatives and processes aimed at managing the control of every institution with the goal of delivering business value, through balancing the risk and return on investment in ICT. However, according to external control agencies of the Federal Public Administration, the adoption of ICT governance is still a challenge in Teaching Federal Institutions. In order to achieve the minimum requirement for ICT Governance it is important to develop mechanisms to support its implementation. The objective this master thesis is creation of a proposal for deployment of ICT governance aligned the mechanisms that driving and assist the institutions in the process of maturing ideas, and making easier the execution of actions to achieve a higher level of maturity in ICT governance. Will be considered in the context, the aspects that involving the Public Sector, addressing pratices, technics and reference models, should be directed from the implementation of corporate governance to management of services, thereby achieving satisfactory results in a short to medium term.", 
    "abstract_pt": "Governança de TIC no setor público é uma estrutura de iniciativas e processos que visa gerir o controle de toda instituição, com o objetivo de agregar valor ao negócio, equilibrando os riscos e o retorno dos investimentos em TIC. Mas é perceptível que essa adoção ainda é um desafio em Instituições Federais de Ensino, de acordo com os órgãos de controle externo da Administração Pública Federal. Para que se consiga atingir o mínimo de exigência de Governança de TIC, é importante o desenvolvimento de mecanismos que auxiliem sua implantação. O objetivo desta dissertação é desenvolver uma proposta de implantação de Governança de TIC alinhada aos mecanismos que impulsionam a Governança Pública, e que visa impulsionar e facilitar as instituições no amadurecimento de ideias, e na execução de ações para o alcance de um nível mais elevado de maturidade em TIC. Serão considerados, neste contexto, os aspectos que envolvem o setor público, abordando práticas, técnicas e modelos de referência, direcionando a instituição desde a implantação da governança corporativa até a gestão dos serviços, conseguindo assim com a sua realização, obter resultados satisfatórios em um curto ou médio prazo.", 
    "area": "", 
    "autor": "NILSON CANDIDO DE OLIVEIRA JUNIOR", 
    "data": "06/08/2015", 
    "evaluators": [
        {
            "category": "Participante Externo", 
            "name": "DECIO FONSECA"
        }, 
        {
            "category": "Docente", 
            "name": "ALEXANDRE MARCOS LINS DE VASCONCELOS"
        }
    ], 
    "idiom": "PORTUGUES", 
    "ies": "UNIVERSIDADE FEDERAL DE PERNAMBUCO", 
    "keywords_en": null, 
    "keywords_pt": [
        "Governança Corporativa. Governança de TI. EGTI. SISP. COBIT. ITIL. ISO 20000. IN04."
    ], 
    "library": "", 
    "page_count": "193", 
    "program": "CIÊNCIAS DA COMPUTAÇÃO (25001019062P6)", 
    "researchLine": "", 
    "researchProjet": null, 
    "sameArea": "Não", 
    "sensei": "HERMANO PERRELLI DE MOURA", 
    "sponsors": [], 
    "title": "UMA PROPOSTA DE IMPLANTAÇÃO DE GOVERNANÇA DE TIC EM INSTITUIÇÕES FEDERAIS DE ENSINO", 
    "tpExpc": "-", 
    "tpVes": "-", 
    "tpVinc": "-", 
    "type_": "DISSERTAÇÃO", 
    "volume": "1"
},
{
    "abstract_en": "The literature describes solutions based on semantic web and ontologies as a strategy integration of data sources. The traditional semantic integration strategy relies on running queries with SPARQL to access data, supported by an ontological representation. This strategy bears a limitation: it does not have enough expressiveness to derive new content due to limited expressiveness. An alternative to SPARQL is to apply reasoning subsumption available for ontologies described in Description Logics (DL). Even in this scenario, DL is not able to determine what an instance is (from data), without explicit statements (axioms). In this sense, there are limitations on the methods available for the semantic web, as it does not provide a solution to enable interpreting data from an ontological point of view. In this work, it is hypothesized that it is possible improve the reasoning mechanisms over the data so that new axioms can be generated according to user demand, e.g. from queries. This process is based on the inherent semantics of the databases, according to an ontological background. For this, along with the semantic web techniques, Knowledge-intensive Case Based Reasoning (CBR-KI) are used to support information retrieval based on similarity analysis to extract the most suitable results. In this sense, this study aims at presenting an evolution to existing KI-CBR methods in order to allow retrieval and generation of cases in heterogeneous environments, integrated through multiple ontologies. It also reuses axioms available in ontologies to define a suitable solution. The solution-making process is related to the extraction of new axioms from the data arrangement and user-created queries. The jCOLIBRI2 tool is used as a basis for the development, as it is delivered as a suite for developing new KI-CBR solutions. Data from biomedical databases (UniProt / SwissProt, Ensembl and NCBI Taxonomy) and biomedical ontologies (Gene Ontology, Chemical Entities of Biological Interest, Protein Ontology and BioTopLite2) are used for exemplification due to manual review of data, presence of data annotations, and level of ontological formalization. The new CBR tool derived from this work is called integrative CBR, and is available as a plugin for the ontology editor Protégé v.5. The contribution of this research is reflected in the implementation of a tool to support the development of solutions based on semantic web and ontologies, able to recover and generate new cases in heterogeneous environments mediated by ontologies.", 
    "abstract_pt": "A literatura tem descrito soluções baseadas em web semântica e ontologias como uma estratégia para a implementação de consultas e integração entre fontes de dados, considerando que ontologias e fontes de dados podem apresentar conteúdo complementar em um mesmo domínio. A estratégia tradicional é baseada na execução de consultas em SPARQL (Query Language for RDF) para acesso aos dados de forma integrada a ontologias. Esta estratégia não apresenta expressividade suficiente para derivar novo conteúdo, pois não vai além da álgebra relacional. Uma alternativa à SPARQL é aplicar raciocínio por subsunção disponível para ontologias descritas com Description Logics (DL). No entanto DL por si só não é capaz de determinar o que significa uma instância (dado) sem a existência de uma descrição explícita (axioma). Nesse sentido, há limitações sobre os métodos disponíveis para a web semântica, pois não apresentam uma solução capaz de interpretar de forma automatizada o que significa uma instância (dado) sem a existência de axiomas os quais descrevam o comportamento do domínio. Neste trabalho, é levantada a hipótese de que é possível realizar o aperfeiçoamento nos mecanismos de raciocínio sobre os dados de forma que novos axiomas possam ser gerados segundo a demanda do usuário, e.g. a partir de consultas. Este processo é baseado na utilização da semântica inerente aos registros dos bancos de dados, e dos mapeamentos existentes entre as ontologias e os bancos. Para isso, além das técnicas de web semântica levantadas, são utilizados métodos de Knowledge-intensive Case Based Reasoning (KI-CBR) para a recuperação das informações que representem os melhores resultados. O presente trabalho tem como objetivo apresentar uma proposta de evolução aos métodos de KI-CBR existentes para permitir a recuperação e a geração de casos em ambientes heterogêneos, integrados por meio de várias ontologias e que incluam as restrições disponíveis nas ontologias no processo de definição de solução. O processo de definição de solução é relacionado à extração de novos axiomas a partir do arranjo dos dados e das consultas criadas pelo usuário. Como ponto de partida, será utilizada e modificada a metodologia de KI-CBR incluída na ferramenta jCOLIBRI2. Dados (UniProt/SwissProt, Ensembl e NCBI Taxonomy) e ontologias (Gene Ontology, Chemical Entities of Biological Interest, Protein Ontology e BioTopLite2) do domínio biológico serão utilizados para exemplificação devido a revisão manual, presença de anotações e nível de formalização do conhecimento. A nova ferramenta de CBR derivada do presente trabalho será chamada de IntegrativO CBR e será disponibilizada como um plugin para o editor de ontologias Protégé v.5. A contribuição desta pesquisa se reflete na implementação de uma ferramenta de auxílio para o desenvolvimento de soluções, baseadas em web semântica e ontologias, capaz de recuperar e gerar novos casos em ambientes heterogêneos mediados por ontologias.", 
    "area": "", 
    "autor": "PLACIDO DAS CHAGAS SOARES SEGUNDO", 
    "data": "27/08/2015", 
    "evaluators": [
        {
            "category": "Docente", 
            "name": "ROBSON DO NASCIMENTO FIDALGO"
        }, 
        {
            "category": "Participante Externo", 
            "name": "RINALDO JOSE DE LIMA"
        }
    ], 
    "idiom": "PORTUGUES", 
    "ies": "UNIVERSIDADE FEDERAL DE PERNAMBUCO", 
    "keywords_en": null, 
    "keywords_pt": [
        "Web Semântica", 
        " Ontologia", 
        " SPARQL", 
        " Description Logics", 
        " KI-CBR", 
        " jCOLIBRI2", 
        " Axioma."
    ], 
    "library": "", 
    "page_count": "102", 
    "program": "CIÊNCIAS DA COMPUTAÇÃO (25001019062P6)", 
    "researchLine": "", 
    "researchProjet": null, 
    "sameArea": "Não", 
    "sensei": "FREDERICO LUIZ GONCALVES DE FREITAS", 
    "sponsors": [], 
    "title": "Aplicação de métodos de raciocínio baseado em casos de conhecimento intensivo para a web semântica: um estudo sobre o domínio biológico", 
    "tpExpc": "-", 
    "tpVes": "-", 
    "tpVinc": "-", 
    "type_": "DISSERTAÇÃO", 
    "volume": "1"
},
{
    "abstract_en": "Project management spreads over several areas. One of it is the communication whose importance is fundamental for project development. When used in a effective way the communication becomes one of the most sucessful factors in a project and also influences in motivation among the team members. An Digital Media Agencies are specialized in ITC, IT and Communication, whose projects assumed are related to products or services for the cliente. Aiming to identify how the communication is applied in projects and which communication tools and metodologies are the most used in projects in digital agencies. The field research shows this outlook and the communication relationship and motivation among the members of the project. Soon after this research nine good practices are suggested to be applied in projects in digital agencies. These practices have the main goal to focus on communication or improve and stimulate it in the Projects development and also providing the reduction of communication noise and finally, motivate and satisfy every stakeholder involved on it.", 
    "abstract_pt": "O gerenciamento de projetos abrange diversas áreas, uma delas é a comunicação, cuja importância é fundamental para o desenvolvimento de um projeto. Quando aplicada de forma eficaz, a comunicação torna-se um dos fatores de sucesso de um projeto, e também influencia na motivação entre os membros de equipe. As agências digitais são empresas especializadas em soluções de TIC, Tecnologia da Informação e Comunicação, cujos os projetos desenvolvidos são produtos ou serviços relacionados com comunicação digital para o cliente. Visando identificar como é aplicada a comunicação nos projetos e quais meios e ferramentas de comunicação são mais utilizados em projetos de agências digitais, a pesquisa de campo mostra esse panorama e também o relacionamento da comunicação e da motivação entre os membros de equipe relacionados ao projeto. E sugere nove boas práticas para serem aplicadas em projetos de agências digitais, com o propósito de trabalhar a comunicação ou fazendo com que a estimule no desenvolvimento dos projetos, proporcionando um melhor desenvolvimento do projeto, eliminando ruídos, e por fim, satisfazer e motivar todos os stakeholders envolvidos.", 
    "area": "", 
    "autor": "SUELEN DE OLIVEIRA MARQUES", 
    "data": "31/08/2015", 
    "evaluators": [
        {
            "category": "Docente", 
            "name": "SIMONE CRISTIANE DOS SANTOS LIMA"
        }, 
        {
            "category": "Participante Externo", 
            "name": "IVALDIR HONORIO DE FARIAS JUNIOR"
        }
    ], 
    "idiom": "PORTUGUES", 
    "ies": "UNIVERSIDADE FEDERAL DE PERNAMBUCO", 
    "keywords_en": null, 
    "keywords_pt": [
        "comunicação. motivação. projetos. gerenciamento de projetos. agência digital."
    ], 
    "library": "", 
    "page_count": "183", 
    "program": "CIÊNCIAS DA COMPUTAÇÃO (25001019062P6)", 
    "researchLine": "", 
    "researchProjet": null, 
    "sameArea": "Não", 
    "sensei": "HERMANO PERRELLI DE MOURA", 
    "sponsors": [], 
    "title": "Comunicação e Motivação em Projetos de Agências Digitais", 
    "tpExpc": "-", 
    "tpVes": "-", 
    "tpVinc": "-", 
    "type_": "DISSERTAÇÃO", 
    "volume": "1"
},
{
    "abstract_en": "Context: The justification for implementing a Project Management Office (PMO) is a recurring problem in organizations, being often questioned by the stakeholders. In the context of the organizational project management, the PMO presents a variety of roles and functions, whose performance is related to strategic objectives achievement. Considering the need to meet the expectations of various stakeholders, it is necessary to evaluate their performance based on the various points of view. Objective: Set software’s PMO performance evaluation based on a multi-criteria approach to decision making. Methodology: Based on a list of 79 performance indicators, divided into 17 criteria defined by the Competing Values Framework, a methodology for evaluating the PMO was defined using a multi-criteria methodology by MACBETH technique, which allowed reflect the views of the various stakeholders interested in the PMO’s performance. Results: The methodology resulted in a valuation model that presented a clear picture of strengths and weaknesses in the performance of the EP, and the priority of improving each of them, according to a shared vision of all stakeholders. Conclusion: Performance evaluation proposal presented an aggregation of different and conflicting views on a comprehensive view of the performance of the project management office, assisting in the definition and prioritization of actions to achieve the desired level of PMO’s performance for the organization.", 
    "abstract_pt": "Contexto: A justificativa para implantação de um Escritório de Projetos (EP), é um problema recorrente nas organizações, sendo sua existência quase sempre questionada pelas partes interessadas. No âmbito do gerenciamento organizacional de projetos, o EP apresenta uma variedade de papéis e funções, cujo desempenho está relacionado ao cumprimento dos objetivos estratégicos. Diante da necessidade de atender às expectativas das várias partes interessadas, faz-se necessário avaliar seu desempenho com base nos vários pontos de vista de uma organização. Objetivo: Definir uma avaliação de desempenho de EPs de software baseado em uma abordagem multicritério para tomada de decisões. Metodologia: Com base em uma lista de 79 indicadores de desempenho, divididos em 17 critérios definidos pelo Competing Values Framework, foi definida uma metodologia de avaliação do EP, utilizando uma metodologia multicritério, através da técnica MACBETH, que permitiu refletir as visões das várias partes da organização interessadas no desempenho do EP. Resultados: A aplicação da metodologia resultou em um modelo de avaliação que apresentou uma visão clara dos pontos fortes e fracos no desempenho do EP, e a prioridade de melhoria de cada um deles, segundo uma visão compartilhada de todos os interessados. Conclusão: A avaliação de desempenho proposta apresentou uma agregação de diferentes e conflitantes pontos de vista em uma visão abrangente sobre o desempenho do escritório de projetos, auxiliando na definição e priorização das ações para atingir o nível de desempenho desejado do EP para a organização.", 
    "area": "", 
    "autor": "TALES GARCIA ALVARENGA VIGLIONI", 
    "data": "17/06/2015", 
    "evaluators": [
        {
            "category": "Participante Externo", 
            "name": "ANA PAULA CABRAL SEIXAS COSTA"
        }, 
        {
            "category": "Docente", 
            "name": "ALEXANDRE MARCOS LINS DE VASCONCELOS"
        }
    ], 
    "idiom": "PORTUGUES", 
    "ies": "UNIVERSIDADE FEDERAL DE PERNAMBUCO", 
    "keywords_en": null, 
    "keywords_pt": [
        "Gerenciamento de Projetos", 
        " Desempenho de Escritório de Projetos", 
        " Projetos de Software", 
        " Abordagem Multicritério", 
        " MACBETH"
    ], 
    "library": "", 
    "page_count": "132", 
    "program": "CIÊNCIAS DA COMPUTAÇÃO (25001019062P6)", 
    "researchLine": "", 
    "researchProjet": null, 
    "sameArea": "Não", 
    "sensei": "HERMANO PERRELLI DE MOURA", 
    "sponsors": [], 
    "title": "Avaliação de Desempenho de Escritórios de Projetos de Software Baseada em uma Abordagem Multicritério", 
    "tpExpc": "-", 
    "tpVes": "-", 
    "tpVinc": "-", 
    "type_": "DISSERTAÇÃO", 
    "volume": "1"
},
{
    "abstract_en": null, 
    "abstract_pt": "Em resposta a uma série de escândalos por fraudes contábeis, o governo dos Estados Unidos criou a Lei Sarbanes-Oxley (SOX), em 30 de Julho de 2002. Esta lei visa responsabilizar os dirigentes de empresas em relação à eficácia de seus controles internos de TI e de negócio sobre a segurança e confiabilidade de seus dados contábeis. A avaliação desses controles é feita por meio de uma auditoria externa e do órgão regulador americano chamado SEC, o qual recomenda o uso do framework COSO para a implementação desses controles. No entanto, o COSO é um framework estratégico, ou seja, não oferece orientações para a implementação tática e operacional de controles, e principalmente não é comumente aplicado na área de TI, sendo normalmente aplicado na área de negócios. Tendo como escopo a área de segurança em banco de dados, e dado que o COSO não oferece detalhamento operacional para garantir o cumprimento da lei SOX nesta área, este trabalho propõe um guia de controles internos para este fim. O guia proposto baseia-se no COBIT 5 e na norma ISO 27002. Como prova de conceito do guia proposto, este foi utilizado como base para desenvolver a ferramenta SOXSecurity4DB, a qual foi usada em uma empresa multinacional do ramo de varejo, que havia contratado um projeto para garantir o cumprimento com a Lei SOX. Como resultado da aplicação da ferramenta, foi observado que alguns controles precisavam remediação, pois ainda haviam problemas para serem resolvidos.", 
    "area": "", 
    "autor": "KAMILLA DORIA DA SILVEIRA", 
    "data": "13/11/2015", 
    "evaluators": [
        {
            "category": "Participante Externo", 
            "name": "DECIO FONSECA"
        }, 
        {
            "category": "Docente", 
            "name": "FERNANDO DA FONSECA DE SOUZA"
        }
    ], 
    "idiom": "PORTUGUES", 
    "ies": "UNIVERSIDADE FEDERAL DE PERNAMBUCO", 
    "keywords_en": null, 
    "keywords_pt": [
        "Lei SOX", 
        " COBIT", 
        " ISO 27002", 
        " controles internos", 
        " auditoria", 
        " banco de dados."
    ], 
    "library": "", 
    "page_count": "97", 
    "program": "CIÊNCIAS DA COMPUTAÇÃO (25001019062P6)", 
    "researchLine": "", 
    "researchProjet": null, 
    "sameArea": "Não", 
    "sensei": "ROBSON DO NASCIMENTO FIDALGO", 
    "sponsors": [], 
    "title": "Controles Internos de Segurança em Banco de Dados para Certificação da Lei SOX", 
    "tpExpc": "-", 
    "tpVes": "-", 
    "tpVinc": "-", 
    "type_": "DISSERTAÇÃO", 
    "volume": "1"
}
]
